Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
.equ	HSEStartUp_TimeOut,	0x0500		@ Time out for HSE start up

.equ	HSI_Value,	8000000				@ Value of the Internal oscillator in Hz

.equ	__MPU_PRESENT,	0				@ STM32 does not provide an MPU
.equ	__NVIC_PRIO_BITS,	4			@ STM32 uses 4 Bits for the Priority Levels
.equ	__Vendor_SysTickConfig,	0		@ Set to 1 if different SysTick Config is used



.equ	SRAM_BB_BASE,	0x22000000		@ SRAM base address in the alias region
.equ	PERIPH_BB_BASE,	0x42000000		@ Peripheral base address in the alias region

.equ	SRAM_BASE,		0x20000000		@ SRAM base address in the bit-band region
.equ	PERIPH_BASE,	0x40000000		@ Peripheral base address in the bit-band region

.equ	FSMC_R_BASE,	0xA0000000		@ FSMC registers base address

@ Peripheral memory map
.equ	APB1PERIPH_BASE,	PERIPH_BASE
.equ	APB2PERIPH_BASE,	PERIPH_BASE + 0x10000
.equ	AHBPERIPH_BASE,	PERIPH_BASE + 0x20000

.equ	TIM2_BASE,	APB1PERIPH_BASE + 0x0000
.equ	TIM3_BASE,	APB1PERIPH_BASE + 0x0400
.equ	TIM4_BASE,	APB1PERIPH_BASE + 0x0800
.equ	TIM5_BASE,	APB1PERIPH_BASE + 0x0C00
.equ	TIM6_BASE,	APB1PERIPH_BASE + 0x1000
.equ	TIM7_BASE,	APB1PERIPH_BASE + 0x1400
.equ	RTC_BASE,	APB1PERIPH_BASE + 0x2800
.equ	WWDG_BASE,	APB1PERIPH_BASE + 0x2C00
.equ	IWDG_BASE,	APB1PERIPH_BASE + 0x3000
.equ	SPI2_BASE,	APB1PERIPH_BASE + 0x3800
.equ	SPI3_BASE,	APB1PERIPH_BASE + 0x3C00
.equ	USART2_BASE,	APB1PERIPH_BASE + 0x4400
.equ	USART3_BASE,	APB1PERIPH_BASE + 0x4800
.equ	UART4_BASE,	APB1PERIPH_BASE + 0x4C00
.equ	UART5_BASE,	APB1PERIPH_BASE + 0x5000
.equ	I2C1_BASE,	APB1PERIPH_BASE + 0x5400
.equ	I2C2_BASE,	APB1PERIPH_BASE + 0x5800
.equ	CAN1_BASE,	APB1PERIPH_BASE + 0x6400
.equ	CAN2_BASE,	APB1PERIPH_BASE + 0x6800
.equ	BKP_BASE,	APB1PERIPH_BASE + 0x6C00
.equ	PWR_BASE,	APB1PERIPH_BASE + 0x7000
.equ	DAC_BASE,	APB1PERIPH_BASE + 0x7400

.equ	AFIO_BASE,	APB2PERIPH_BASE + 0x0000
.equ	EXTI_BASE,	APB2PERIPH_BASE + 0x0400
.equ	GPIOA_BASE,	APB2PERIPH_BASE + 0x0800
.equ	GPIOB_BASE,	APB2PERIPH_BASE + 0x0C00
.equ	GPIOC_BASE,	APB2PERIPH_BASE + 0x1000
.equ	GPIOD_BASE,	APB2PERIPH_BASE + 0x1400
.equ	GPIOE_BASE,	APB2PERIPH_BASE + 0x1800
.equ	GPIOF_BASE,	APB2PERIPH_BASE + 0x1C00
.equ	GPIOG_BASE,	APB2PERIPH_BASE + 0x2000
.equ	ADC1_BASE,	APB2PERIPH_BASE + 0x2400
.equ	ADC2_BASE,	APB2PERIPH_BASE + 0x2800
.equ	TIM1_BASE,	APB2PERIPH_BASE + 0x2C00
.equ	SPI1_BASE,	APB2PERIPH_BASE + 0x3000
.equ	TIM8_BASE,	APB2PERIPH_BASE + 0x3400
.equ	USART1_BASE,	APB2PERIPH_BASE + 0x3800
.equ	ADC3_BASE,	APB2PERIPH_BASE + 0x3C00

.equ	SDIO_BASE,			PERIPH_BASE + 0x18000

.equ	DMA1_BASE,			AHBPERIPH_BASE + 0x0000
.equ	DMA1_Channel1_BASE,	AHBPERIPH_BASE + 0x0008
.equ	DMA1_Channel2_BASE,	AHBPERIPH_BASE + 0x001C
.equ	DMA1_Channel3_BASE,	AHBPERIPH_BASE + 0x0030
.equ	DMA1_Channel4_BASE,	AHBPERIPH_BASE + 0x0044
.equ	DMA1_Channel5_BASE,	AHBPERIPH_BASE + 0x0058
.equ	DMA1_Channel6_BASE,	AHBPERIPH_BASE + 0x006C
.equ	DMA1_Channel7_BASE,	AHBPERIPH_BASE + 0x0080
.equ	DMA2_BASE,			AHBPERIPH_BASE + 0x0400
.equ	DMA2_Channel1_BASE,	AHBPERIPH_BASE + 0x0408
.equ	DMA2_Channel2_BASE,	AHBPERIPH_BASE + 0x041C
.equ	DMA2_Channel3_BASE,	AHBPERIPH_BASE + 0x0430
.equ	DMA2_Channel4_BASE,	AHBPERIPH_BASE + 0x0444
.equ	DMA2_Channel5_BASE,	AHBPERIPH_BASE + 0x0458
.equ	RCC_BASE,			AHBPERIPH_BASE + 0x1000
.equ	CRC_BASE,			AHBPERIPH_BASE + 0x3000

.equ	FLASH_R_BASE,	AHBPERIPH_BASE + 0x2000 @ Flash registers base address
.equ	OB_BASE,	0x1FFFF800 @ Flash Option Bytes base address

.equ	ETH_BASE,		AHBPERIPH_BASE + 0x8000
.equ	ETH_MAC_BASE,	ETH_BASE
.equ	ETH_MMC_BASE,	ETH_BASE + 0x0100
.equ	ETH_PTP_BASE,	ETH_BASE + 0x0700
.equ	ETH_DMA_BASE,	ETH_BASE + 0x1000

.equ	FSMC_Bank1_R_BASE,	FSMC_R_BASE + 0x0000 @ FSMC Bank1 registers base address
.equ	FSMC_Bank1E_R_BASE,	FSMC_R_BASE + 0x0104 @ FSMC Bank1E registers base address
.equ	FSMC_Bank2_R_BASE,	FSMC_R_BASE + 0x0060 @ FSMC Bank2 registers base address
.equ	FSMC_Bank3_R_BASE,	FSMC_R_BASE + 0x0080 @ FSMC Bank3 registers base address
.equ	FSMC_Bank4_R_BASE,	FSMC_R_BASE + 0x00A0 @ FSMC Bank4 registers base address

.equ	DBGMCU_BASE,	0xE0042000 @ Debug MCU registers base address

.equ	SCS_BASE,	0xE000E000


.equ	ETH_MACCR,	ETH_MAC_BASE
.equ	ETH_MACFFR,	ETH_MACCR + 0x04
.equ	ETH_MACHTHR,	ETH_MACCR + 0x08
.equ	ETH_MACHTLR,	ETH_MACCR + 0x0C
.equ	ETH_MACMIIAR,	ETH_MACCR + 0x10
.equ	ETH_MACMIIDR,	ETH_MACCR + 0x14
.equ	ETH_MACFCR,	ETH_MACCR + 0x18
.equ	ETH_MACVLANTR,	ETH_MACCR + 0x1C
.equ	ETH_MACRWUFFR,	ETH_MACCR + 0x28
.equ	ETH_MACPMTCSR,	ETH_MACCR + 0x2C
.equ	ETH_MACSR,	ETH_MACCR + 0x38
.equ	ETH_MACIMR,	ETH_MACCR + 0x3C
.equ	ETH_MACA0HR,	ETH_MACCR + 0x40
.equ	ETH_MACA0LR,	ETH_MACCR + 0x44
.equ	ETH_MACA1HR,	ETH_MACCR + 0x48
.equ	ETH_MACA1LR,	ETH_MACCR + 0x4C
.equ	ETH_MACA2HR,	ETH_MACCR + 0x50
.equ	ETH_MACA2LR,	ETH_MACCR + 0x54
.equ	ETH_MACA3HR,	ETH_MACCR + 0x58
.equ	ETH_MACA3LR,	ETH_MACCR + 0x5C
.equ	ETH_MMCCR,	ETH_MMC_BASE
.equ	ETH_MMCRIR,	ETH_MMCCR + 0x04
.equ	ETH_MMCTIR,	ETH_MMCCR + 0x08
.equ	ETH_MMCRIMR,	ETH_MMCCR + 0x0C
.equ	ETH_MMCTIMR,	ETH_MMCCR + 0x10
.equ	ETH_MMCTGFSCCR,	ETH_MMCCR + 0x4C
.equ	ETH_MMCTGFMSCCR,	ETH_MMCCR + 0x50
.equ	ETH_MMCTGFCR,	ETH_MMCCR + 0x68
.equ	ETH_MMCRFCECR,	ETH_MMCCR + 0x94
.equ	ETH_MMCRFAECR,	ETH_MMCCR + 0x98
.equ	ETH_MMCRGUFCR,	ETH_MMCCR + 0xC4
.equ	ETH_PTPTSCR,	ETH_PTP_BASE
.equ	ETH_PTPSSIR,	ETH_PTP_BASE + 0x04
.equ	ETH_PTPTSHR,	ETH_PTP_BASE + 0x08
.equ	ETH_PTPTSLR,	ETH_PTP_BASE + 0x0C
.equ	ETH_PTPTSHUR,	ETH_PTP_BASE + 0x10
.equ	ETH_PTPTSLUR,	ETH_PTP_BASE + 0x14
.equ	ETH_PTPTSAR,	ETH_PTP_BASE + 0x18
.equ	ETH_PTPTTHR,	ETH_PTP_BASE + 0x1C
.equ	ETH_PTPTTLR,	ETH_PTP_BASE + 0x20
.equ	ETH_DMABMR,	ETH_DMA_BASE
.equ	ETH_DMATPDR,	ETH_DMA_BASE + 0x04
.equ	ETH_DMARPDR,	ETH_DMA_BASE + 0x08
.equ	ETH_DMARDLAR,	ETH_DMA_BASE + 0x0C
.equ	ETH_DMATDLAR,	ETH_DMA_BASE + 0x10
.equ	ETH_DMASR,	ETH_DMA_BASE + 0x14
.equ	ETH_DMAOMR,	ETH_DMA_BASE + 0x18
.equ	ETH_DMAIER,	ETH_DMA_BASE + 0x1C
.equ	ETH_DMAMFBOCR,	ETH_DMA_BASE + 0x20
.equ	ETH_DMACHTDR,	ETH_DMA_BASE + 0x48
.equ	ETH_DMACHRDR,	ETH_DMA_BASE + 0x4C
.equ	ETH_DMACHTBAR,	ETH_DMA_BASE + 0x50
.equ	ETH_DMACHRBAR,	ETH_DMA_BASE + 0x54


.equ	TIM2,	TIM2_BASE
.equ	TIM3,	TIM3_BASE
.equ	TIM4,	TIM4_BASE
.equ	TIM5,	TIM5_BASE
.equ	TIM6,	TIM6_BASE
.equ	TIM7,	TIM7_BASE
.equ	RTC,	RTC_BASE
.equ	WWDG,	WWDG_BASE
.equ	IWDG,	IWDG_BASE
.equ	SPI2,	SPI2_BASE
.equ	SPI3,	SPI3_BASE
.equ	USART2,	USART2_BASE
.equ	USART3,	USART3_BASE
.equ	UART4,	UART4_BASE
.equ	UART5,	UART5_BASE
.equ	I2C1,	I2C1_BASE
.equ	I2C2,	I2C2_BASE
.equ	CAN1,	CAN1_BASE
.equ	CAN2,	CAN2_BASE
.equ	BKP,	BKP_BASE
.equ	PWR,	PWR_BASE
.equ	DAC,	DAC_BASE
.equ	AFIO,	AFIO_BASE
.equ	EXTI,	EXTI_BASE
.equ	GPIOA,	GPIOA_BASE
.equ	GPIOB,	GPIOB_BASE
.equ	GPIOC,	GPIOC_BASE
.equ	GPIOD,	GPIOD_BASE
.equ	GPIOE,	GPIOE_BASE
.equ	GPIOF,	GPIOF_BASE
.equ	GPIOG,	GPIOG_BASE
.equ	ADC1,	ADC1_BASE
.equ	ADC2,	ADC2_BASE
.equ	TIM1,	TIM1_BASE
.equ	SPI1,	SPI1_BASE
.equ	TIM8,	TIM8_BASE
.equ	USART1,	USART1_BASE
.equ	ADC3,	ADC3_BASE
.equ	SDIO,	SDIO_BASE
.equ	DMA1,	DMA1_BASE
.equ	DMA2,	DMA2_BASE
.equ	DMA1_Channel1,	DMA1_Channel1_BASE
.equ	DMA1_Channel2,	DMA1_Channel2_BASE
.equ	DMA1_Channel3,	DMA1_Channel3_BASE
.equ	DMA1_Channel4,	DMA1_Channel4_BASE
.equ	DMA1_Channel5,	DMA1_Channel5_BASE
.equ	DMA1_Channel6,	DMA1_Channel6_BASE
.equ	DMA1_Channel7,	DMA1_Channel7_BASE
.equ	DMA2_Channel1,	DMA2_Channel1_BASE
.equ	DMA2_Channel2,	DMA2_Channel2_BASE
.equ	DMA2_Channel3,	DMA2_Channel3_BASE
.equ	DMA2_Channel4,	DMA2_Channel4_BASE
.equ	DMA2_Channel5,	DMA2_Channel5_BASE
.equ	RCC,	RCC_BASE
.equ	CRC,	CRC_BASE
.equ	FLASH,	FLASH_R_BASE
.equ	OB,	OB_BASE
.equ	ETH,	ETH_BASE
.equ	FSMC_Bank1,	FSMC_Bank1_R_BASE
.equ	FSMC_Bank1E,	FSMC_Bank1E_R_BASE
.equ	FSMC_Bank2,	FSMC_Bank2_R_BASE
.equ	FSMC_Bank3,	FSMC_Bank3_R_BASE
.equ	FSMC_Bank4,	FSMC_Bank4_R_BASE
.equ	DBGMCU,	DBGMCU_BASE


