Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
.equ	PWR_CR,	0x40007000
.equ	PWR_CSR,	0x40007004
.equ	RCC_CR,	0x40021000
.equ	RCC_CFGR,	0x40021004
.equ	RCC_CIR,	0x40021008
.equ	RCC_APB2RSTR,	0x4002100C
.equ	RCC_APB1RSTR,	0x40021010
.equ	RCC_AHBENR,	0x40021014
.equ	RCC_APB2ENR,	0x40021018
.equ	RCC_APB1ENR,	0x4002101C
.equ	RCC_BDCR,	0x40021020
.equ	RCC_CSR,	0x40021024
.equ	GPIOA_CRL,	0x40010800
.equ	GPIOA_CRH,	0x40010804
.equ	GPIOA_IDR,	0x40010808
.equ	GPIOA_ODR,	0x4001080C
.equ	GPIOA_BSRR,	0x40010810
.equ	GPIOA_BRR,	0x40010814
.equ	GPIOA_LCKR,	0x40010818
.equ	GPIOB_CRL,	0x40010C00
.equ	GPIOB_CRH,	0x40010C04
.equ	GPIOB_IDR,	0x40010C08
.equ	GPIOB_ODR,	0x40010C0C
.equ	GPIOB_BSRR,	0x40010C10
.equ	GPIOB_BRR,	0x40010C14
.equ	GPIOB_LCKR,	0x40010C18
.equ	GPIOC_CRL,	0x40011000
.equ	GPIOC_CRH,	0x40011004
.equ	GPIOC_IDR,	0x40011008
.equ	GPIOC_ODR,	0x4001100C
.equ	GPIOC_BSRR,	0x40011010
.equ	GPIOC_BRR,	0x40011014
.equ	GPIOC_LCKR,	0x40011018
.equ	GPIOD_CRL,	0x40011400
.equ	GPIOD_CRH,	0x40011404
.equ	GPIOD_IDR,	0x40011408
.equ	GPIOD_ODR,	0x4001140C
.equ	GPIOD_BSRR,	0x40011410
.equ	GPIOD_BRR,	0x40011414
.equ	GPIOD_LCKR,	0x40011418
.equ	GPIOE_CRL,	0x40011800
.equ	GPIOE_CRH,	0x40011804
.equ	GPIOE_IDR,	0x40011808
.equ	GPIOE_ODR,	0x4001180C
.equ	GPIOE_BSRR,	0x40011810
.equ	GPIOE_BRR,	0x40011814
.equ	GPIOE_LCKR,	0x40011818
.equ	GPIOF_CRL,	0x40011C00
.equ	GPIOF_CRH,	0x40011C04
.equ	GPIOF_IDR,	0x40011C08
.equ	GPIOF_ODR,	0x40011C0C
.equ	GPIOF_BSRR,	0x40011C10
.equ	GPIOF_BRR,	0x40011C14
.equ	GPIOF_LCKR,	0x40011C18
.equ	GPIOG_CRL,	0x40012000
.equ	GPIOG_CRH,	0x40012004
.equ	GPIOG_IDR,	0x40012008
.equ	GPIOG_ODR,	0x4001200C
.equ	GPIOG_BSRR,	0x40012010
.equ	GPIOG_BRR,	0x40012014
.equ	GPIOG_LCKR,	0x40012018
.equ	AFIO_EVCR,	0x40010000
.equ	AFIO_MAPR,	0x40010004
.equ	AFIO_EXTICR1,	0x40010008
.equ	AFIO_EXTICR2,	0x4001000C
.equ	AFIO_EXTICR3,	0x40010010
.equ	AFIO_EXTICR4,	0x40010014
.equ	EXTI_IMR,	0x40010400
.equ	EXTI_EMR,	0x40010404
.equ	EXTI_RTSR,	0x40010408
.equ	EXTI_FTSR,	0x4001040C
.equ	EXTI_SWIER,	0x40010410
.equ	EXTI_PR,	0x40010414
.equ	DMA_ISR,	0x40020000
.equ	DMA_IFCR,	0x40020004
.equ	DMA_CCR1,	0x40020008
.equ	DMA_CNDTR1,	0x4002000C
.equ	DMA_CPAR1,	0x40020010
.equ	DMA_CMAR1,	0x40020014
.equ	DMA_CCR2,	0x4002001C
.equ	DMA_CNDTR2,	0x40020020
.equ	DMA_CPAR2,	0x40020024
.equ	DMA_CMAR2,	0x40020028
.equ	DMA_CCR3,	0x40020030
.equ	DMA_CNDTR3,	0x40020034
.equ	DMA_CPAR3,	0x40020038
.equ	DMA_CMAR3,	0x4002003C
.equ	DMA_CCR4,	0x40020044
.equ	DMA_CNDTR4,	0x40020048
.equ	DMA_CPAR4,	0x4002004C
.equ	DMA_CMAR4,	0x40020050
.equ	DMA_CCR5,	0x40020058
.equ	DMA_CNDTR5,	0x4002005C
.equ	DMA_CPAR5,	0x40020060
.equ	DMA_CMAR5,	0x40020064
.equ	DMA_CCR6,	0x4002006C
.equ	DMA_CNDTR6,	0x40020070
.equ	DMA_CPAR6,	0x40020074
.equ	DMA_CMAR6,	0x40020078
.equ	DMA_CCR7,	0x40020080
.equ	DMA_CNDTR7,	0x40020084
.equ	DMA_CPAR7,	0x40020088
.equ	DMA_CMAR7,	0x4002008C
.equ	DMA2_ISR,	0x40020400
.equ	DMA2_IFCR,	0x40020404
.equ	DMA2_CCR1,	0x40020408
.equ	DMA2_CNDTR1,	0x4002040C
.equ	DMA2_CPAR1,	0x40020410
.equ	DMA2_CMAR1,	0x40020414
.equ	DMA2_CCR2,	0x4002041C
.equ	DMA2_CNDTR2,	0x40020420
.equ	DMA2_CPAR2,	0x40020424
.equ	DMA2_CMAR2,	0x40020428
.equ	DMA2_CCR3,	0x40020430
.equ	DMA2_CNDTR3,	0x40020434
.equ	DMA2_CPAR3,	0x40020438
.equ	DMA2_CMAR3,	0x4002043C
.equ	DMA2_CCR4,	0x40020444
.equ	DMA2_CNDTR4,	0x40020448
.equ	DMA2_CPAR4,	0x4002044C
.equ	DMA2_CMAR4,	0x40020450
.equ	DMA2_CCR5,	0x40020458
.equ	DMA2_CNDTR5,	0x4002045C
.equ	DMA2_CPAR5,	0x40020460
.equ	DMA2_CMAR5,	0x40020464
.equ	RTC_CRH,	0x40002800
.equ	RTC_CRL,	0x40002804
.equ	RTC_PRLH,	0x40002808
.equ	RTC_PRLL,	0x4000280C
.equ	RTC_DIVH,	0x40002810
.equ	RTC_DIVL,	0x40002814
.equ	RTC_CNTH,	0x40002818
.equ	RTC_CNTL,	0x4000281C
.equ	RTC_ALRH,	0x40002820
.equ	RTC_ALRL,	0x40002824
.equ	BKP_DR1,	0x40006C04
.equ	BKP_DR2,	0x40006C08
.equ	BKP_DR3,	0x40006C0C
.equ	BKP_DR4,	0x40006C10
.equ	BKP_DR5,	0x40006C14
.equ	BKP_DR6,	0x40006C18
.equ	BKP_DR7,	0x40006C1C
.equ	BKP_DR8,	0x40006C20
.equ	BKP_DR9,	0x40006C24
.equ	BKP_DR10,	0x40006C28
.equ	BKP_RTCCR,	0x40006C2C
.equ	BKP_CR,	0x40006C30
.equ	BKP_CSR,	0x40006C34
.equ	BKP_DR11,	0x40006C40
.equ	BKP_DR12,	0x40006C44
.equ	BKP_DR13,	0x40006C48
.equ	BKP_DR14,	0x40006C4C
.equ	BKP_DR15,	0x40006C50
.equ	BKP_DR16,	0x40006C54
.equ	BKP_DR17,	0x40006C58
.equ	BKP_DR18,	0x40006C5C
.equ	BKP_DR19,	0x40006C60
.equ	BKP_DR20,	0x40006C64
.equ	BKP_DR21,	0x40006C68
.equ	BKP_DR22,	0x40006C6C
.equ	BKP_DR23,	0x40006C70
.equ	BKP_DR24,	0x40006C74
.equ	BKP_DR25,	0x40006C78
.equ	BKP_DR26,	0x40006C7C
.equ	BKP_DR27,	0x40006C80
.equ	BKP_DR28,	0x40006C84
.equ	BKP_DR29,	0x40006C88
.equ	BKP_DR30,	0x40006C8C
.equ	BKP_DR31,	0x40006C90
.equ	BKP_DR32,	0x40006C94
.equ	BKP_DR33,	0x40006C98
.equ	BKP_DR34,	0x40006C9C
.equ	BKP_DR35,	0x40006CA0
.equ	BKP_DR36,	0x40006CA4
.equ	BKP_DR37,	0x40006CA8
.equ	BKP_DR38,	0x40006CAC
.equ	BKP_DR39,	0x40006CB0
.equ	BKP_DR40,	0x40006CB4
.equ	BKP_DR41,	0x40006CB8
.equ	BKP_DR42,	0x40006CBC
.equ	IWDG_KR,	0x40003000
.equ	IWDG_PR,	0x40003004
.equ	IWDG_RLR,	0x40003008
.equ	IWDG_SR,	0x4000300C
.equ	WWDG_CR,	0x40002C00
.equ	WWDG_CFR,	0x40002C04
.equ	WWDG_SR,	0x40002C08
.equ	TIM1_CR1,	0x40012C00
.equ	TIM1_CR2,	0x40012C04
.equ	TIM1_SMCR,	0x40012C08
.equ	TIM1_DIER,	0x40012C0C
.equ	TIM1_SR,	0x40012C10
.equ	TIM1_EGR,	0x40012C14
.equ	TIM1_CCMR1,	0x40012C18
.equ	TIM1_OCMR1,	0x40012C18
.equ	TIM1_CCMR2,	0x40012C1C
.equ	TIM1_OCMR2,	0x40012C1C
.equ	TIM1_CCER,	0x40012C20
.equ	TIM1_CNT,	0x40012C24
.equ	TIM1_PSC,	0x40012C28
.equ	TIM1_ARR,	0x40012C2C
.equ	TIM1_RCR,	0x40012C30
.equ	TIM1_CCR1,	0x40012C34
.equ	TIM1_CCR2,	0x40012C38
.equ	TIM1_CCR3,	0x40012C3C
.equ	TIM1_CCR4,	0x40012C40
.equ	TIM1_BDTR,	0x40012C44
.equ	TIM1_DCR,	0x40012C48
.equ	TIM1_DMAR,	0x40012C4C
.equ	TIM8_CR1,	0x40013400
.equ	TIM8_CR2,	0x40013404
.equ	TIM8_SMCR,	0x40013408
.equ	TIM8_DIER,	0x4001340C
.equ	TIM8_SR,	0x40013410
.equ	TIM8_EGR,	0x40013414
.equ	TIM8_CCMR1,	0x40013418
.equ	TIM8_OCMR1,	0x40013418
.equ	TIM8_CCMR2,	0x4001341C
.equ	TIM8_OCMR2,	0x4001341C
.equ	TIM8_CCER,	0x40013420
.equ	TIM8_CNT,	0x40013424
.equ	TIM8_PSC,	0x40013428
.equ	TIM8_ARR,	0x4001342C
.equ	TIM8_RCR,	0x40013430
.equ	TIM8_CCR1,	0x40013434
.equ	TIM8_CCR2,	0x40013438
.equ	TIM8_CCR3,	0x4001343C
.equ	TIM8_CCR4,	0x40013440
.equ	TIM8_BDTR,	0x40013444
.equ	TIM8_DCR,	0x40013448
.equ	TIM8_DMAR,	0x4001344C
.equ	TIM2_CR1,	0x40000000
.equ	TIM2_CR2,	0x40000004
.equ	TIM2_SMCR,	0x40000008
.equ	TIM2_DIER,	0x4000000C
.equ	TIM2_SR,	0x40000010
.equ	TIM2_EGR,	0x40000014
.equ	TIM2_CCMR1,	0x40000018
.equ	TIM2_OCMR1,	0x40000018
.equ	TIM2_CCMR2,	0x4000001C
.equ	TIM2_OCMR2,	0x4000001C
.equ	TIM2_CCER,	0x40000020
.equ	TIM2_CNT,	0x40000024
.equ	TIM2_PSC,	0x40000028
.equ	TIM2_ARR,	0x4000002C
.equ	TIM2_CCR1,	0x40000034
.equ	TIM2_CCR2,	0x40000038
.equ	TIM2_CCR3,	0x4000003C
.equ	TIM2_CCR4,	0x40000040
.equ	TIM2_DCR,	0x40000048
.equ	TIM2_DMAR,	0x4000004C
.equ	TIM3_CR1,	0x40000400
.equ	TIM3_CR2,	0x40000404
.equ	TIM3_SMCR,	0x40000408
.equ	TIM3_DIER,	0x4000040C
.equ	TIM3_SR,	0x40000410
.equ	TIM3_EGR,	0x40000414
.equ	TIM3_CCMR1,	0x40000418
.equ	TIM3_OCMR1,	0x40000418
.equ	TIM3_CCMR2,	0x4000041C
.equ	TIM3_OCMR2,	0x4000041C
.equ	TIM3_CCER,	0x40000420
.equ	TIM3_CNT,	0x40000424
.equ	TIM3_PSC,	0x40000428
.equ	TIM3_ARR,	0x4000042C
.equ	TIM3_CCR1,	0x40000434
.equ	TIM3_CCR2,	0x40000438
.equ	TIM3_CCR3,	0x4000043C
.equ	TIM3_CCR4,	0x40000440
.equ	TIM3_DCR,	0x40000448
.equ	TIM3_DMAR,	0x4000044C
.equ	TIM4_CR1,	0x40000800
.equ	TIM4_CR2,	0x40000804
.equ	TIM4_SMCR,	0x40000808
.equ	TIM4_DIER,	0x4000080C
.equ	TIM4_SR,	0x40000810
.equ	TIM4_EGR,	0x40000814
.equ	TIM4_CCMR1,	0x40000818
.equ	TIM4_OCMR1,	0x40000818
.equ	TIM4_CCMR2,	0x4000081C
.equ	TIM4_OCMR2,	0x4000081C
.equ	TIM4_CCER,	0x40000820
.equ	TIM4_CNT,	0x40000824
.equ	TIM4_PSC,	0x40000828
.equ	TIM4_ARR,	0x4000082C
.equ	TIM4_CCR1,	0x40000834
.equ	TIM4_CCR2,	0x40000838
.equ	TIM4_CCR3,	0x4000083C
.equ	TIM4_CCR4,	0x40000840
.equ	TIM4_DCR,	0x40000848
.equ	TIM4_DMAR,	0x4000084C
.equ	TIM5_CR1,	0x40000C00
.equ	TIM5_CR2,	0x40000C04
.equ	TIM5_SMCR,	0x40000C08
.equ	TIM5_DIER,	0x40000C0C
.equ	TIM5_SR,	0x40000C10
.equ	TIM5_EGR,	0x40000C14
.equ	TIM5_CCMR1,	0x40000C18
.equ	TIM5_OCMR1,	0x40000C18
.equ	TIM5_CCMR2,	0x40000C1C
.equ	TIM5_OCMR2,	0x40000C1C
.equ	TIM5_CCER,	0x40000C20
.equ	TIM5_CNT,	0x40000C24
.equ	TIM5_PSC,	0x40000C28
.equ	TIM5_ARR,	0x40000C2C
.equ	TIM5_CCR1,	0x40000C34
.equ	TIM5_CCR2,	0x40000C38
.equ	TIM5_CCR3,	0x40000C3C
.equ	TIM5_CCR4,	0x40000C40
.equ	TIM5_DCR,	0x40000C48
.equ	TIM5_DMAR,	0x40000C4C
.equ	TIM6_CR1,	0x40001000
.equ	TIM6_CR2,	0x40001004
.equ	TIM6_DIER,	0x4000100C
.equ	TIM6_SR,	0x40001010
.equ	TIM6_EGR,	0x40001014
.equ	TIM6_CNT,	0x40001024
.equ	TIM6_PSC,	0x40001028
.equ	TIM6_ARR,	0x4000102C
.equ	TIM7_CR1,	0x40001400
.equ	TIM7_CR2,	0x40001404
.equ	TIM7_DIER,	0x4000140C
.equ	TIM7_SR,	0x40001410
.equ	TIM7_EGR,	0x40001414
.equ	TIM7_CNT,	0x40001424
.equ	TIM7_PSC,	0x40001428
.equ	TIM7_ARR,	0x4000142C
.equ	CAN_MCR,	0x40006400
.equ	CAN_MSR,	0x40006404
.equ	CAN_TSR,	0x40006408
.equ	CAN_RF0R,	0x4000640C
.equ	CAN_RF1R,	0x40006410
.equ	CAN_IER,	0x40006414
.equ	CAN_ESR,	0x40006418
.equ	CAN_BTR,	0x4000641C
.equ	CAN_TI0R,	0x40006580
.equ	CAN_TDT0R,	0x40006584
.equ	CAN_TDL0R,	0x40006588
.equ	CAN_TDH0R,	0x4000658C
.equ	CAN_TI1R,	0x40006590
.equ	CAN_TDT1R,	0x40006594
.equ	CAN_TDL1R,	0x40006598
.equ	CAN_TDH1R,	0x4000659C
.equ	CAN_TI2R,	0x400065A0
.equ	CAN_TDT2R,	0x400065A4
.equ	CAN_TDL2R,	0x400065A8
.equ	CAN_TDH2R,	0x400065AC
.equ	CAN_RI0R,	0x400065B0
.equ	CAN_RDT0R,	0x400065B4
.equ	CAN_RDL0R,	0x400065B8
.equ	CAN_RDH0R,	0x400065BC
.equ	CAN_RI1R,	0x400065C0
.equ	CAN_RDT1R,	0x400065C4
.equ	CAN_RDL1R,	0x400065C8
.equ	CAN_RDH1R,	0x400065CC
.equ	CAN_FMR,	0x40006600
.equ	CAN_FM1R,	0x40006604
.equ	CAN_FS1R,	0x4000660C
.equ	CAN_FFA1R,	0x40006614
.equ	CAN_FA1R,	0x4000661C
.equ	CAN_F0R1,	0x40006640
.equ	CAN_F0R2,	0x40006644
.equ	CAN_F1R1,	0x40006648
.equ	CAN_F1R2,	0x4000664C
.equ	CAN_F2R1,	0x40006650
.equ	CAN_F2R2,	0x40006654
.equ	CAN_F3R1,	0x40006658
.equ	CAN_F3R2,	0x4000665C
.equ	CAN_F4R1,	0x40006660
.equ	CAN_F4R2,	0x40006664
.equ	CAN_F5R1,	0x40006668
.equ	CAN_F5R2,	0x4000666C
.equ	CAN_F6R1,	0x40006670
.equ	CAN_F6R2,	0x40006674
.equ	CAN_F7R1,	0x40006678
.equ	CAN_F7R2,	0x4000667C
.equ	CAN_F8R1,	0x40006680
.equ	CAN_F8R2,	0x40006684
.equ	CAN_F9R1,	0x40006688
.equ	CAN_F9R2,	0x4000668C
.equ	CAN_F10R1,	0x40006690
.equ	CAN_F10R2,	0x40006694
.equ	CAN_F11R1,	0x40006698
.equ	CAN_F11R2,	0x4000669C
.equ	CAN_F12R1,	0x400066A0
.equ	CAN_F12R2,	0x400066A4
.equ	CAN_F13R1,	0x400066A8
.equ	CAN_F13R2,	0x400066AC
.equ	I2C1_CR1,	0x40005400
.equ	I2C1_CR2,	0x40005404
.equ	I2C1_OAR1,	0x40005408
.equ	I2C1_OAR2,	0x4000540C
.equ	I2C1_DR,	0x40005410
.equ	I2C1_SR1,	0x40005414
.equ	I2C1_SR2,	0x40005418
.equ	I2C1_CCR,	0x4000541C
.equ	I2C1_TRISE,	0x40005420
.equ	I2C2_CR1,	0x40005800
.equ	I2C2_CR2,	0x40005804
.equ	I2C2_OAR1,	0x40005808
.equ	I2C2_OAR2,	0x4000580C
.equ	I2C2_DR,	0x40005810
.equ	I2C2_SR1,	0x40005814
.equ	I2C2_SR2,	0x40005818
.equ	I2C2_CCR,	0x4000581C
.equ	I2C2_TRISE,	0x40005820
.equ	SPI1_CR1,	0x40013000
.equ	SPI1_CR2,	0x40013004
.equ	SPI1_SR,	0x40013008
.equ	SPI1_DR,	0x4001300C
.equ	SPI1_CRCPR,	0x40013010
.equ	SPI1_RXCRCR,	0x40013014
.equ	SPI1_TXCRCR,	0x40013018
.equ	SPI2_CR1,	0x40003800
.equ	SPI2_CR2,	0x40003804
.equ	SPI2_SR,	0x40003808
.equ	SPI2_DR,	0x4000380C
.equ	SPI2_CRCPR,	0x40003810
.equ	SPI2_RXCRCR,	0x40003814
.equ	SPI2_TXCRCR,	0x40003818
.equ	SPI2_I2SCFGR,	0x4000381C
.equ	SPI2_I2SPR,	0x40003820
.equ	SPI3_CR1,	0x40003C00
.equ	SPI3_CR2,	0x40003C04
.equ	SPI3_SR,	0x40003C08
.equ	SPI3_DR,	0x40003C0C
.equ	SPI3_CRCPR,	0x40003C10
.equ	SPI3_RXCRCR,	0x40003C14
.equ	SPI3_TXCRCR,	0x40003C18
.equ	SPI3_I2SCFGR,	0x40003C1C
.equ	SPI3_I2SPR,	0x40003C20
.equ	USART1_SR,	0x40013800
.equ	USART1_DR,	0x40013804
.equ	USART1_BRR,	0x40013808
.equ	USART1_CR1,	0x4001380C
.equ	USART1_CR2,	0x40013810
.equ	USART1_CR3,	0x40013814
.equ	USART1_GTPR,	0x40013818
.equ	USART2_SR,	0x40004400
.equ	USART2_DR,	0x40004404
.equ	USART2_BRR,	0x40004408
.equ	USART2_CR1,	0x4000440C
.equ	USART2_CR2,	0x40004410
.equ	USART2_CR3,	0x40004414
.equ	USART2_GTPR,	0x40004418
.equ	USART3_SR,	0x40004800
.equ	USART3_DR,	0x40004804
.equ	USART3_BRR,	0x40004808
.equ	USART3_CR1,	0x4000480C
.equ	USART3_CR2,	0x40004810
.equ	USART3_CR3,	0x40004814
.equ	USART3_GTPR,	0x40004818
.equ	UART4_SR,	0x40004C00
.equ	UART4_DR,	0x40004C04
.equ	UART4_BRR,	0x40004C08
.equ	UART4_CR1,	0x40004C0C
.equ	UART4_CR2,	0x40004C10
.equ	UART4_CR3,	0x40004C14
.equ	UART5_SR,	0x40005000
.equ	UART5_DR,	0x40005004
.equ	UART5_BRR,	0x40005008
.equ	UART5_CR1,	0x4000500C
.equ	UART5_CR2,	0x40005010
.equ	UART5_CR3,	0x40005014
.equ	USB_EP0R,	0x40005C00
.equ	USB_EP1R,	0x40005C04
.equ	USB_EP2R,	0x40005C08
.equ	USB_EP3R,	0x40005C0C
.equ	USB_EP4R,	0x40005C10
.equ	USB_EP5R,	0x40005C14
.equ	USB_EP6R,	0x40005C18
.equ	USB_EP7R,	0x40005C1C
.equ	USB_CR,	0x40005C40
.equ	USB_ISR,	0x40005C44
.equ	USB_FNR,	0x40005C48
.equ	USB_ADDR,	0x40005C4C
.equ	USB_BTAR,	0x40005C50
.equ	ADC1_SR,	0x40012400
.equ	ADC1_CR1,	0x40012404
.equ	ADC1_CR2,	0x40012408
.equ	ADC1_SMPR1,	0x4001240C
.equ	ADC1_SMPR2,	0x40012410
.equ	ADC1_JOFR1,	0x40012414
.equ	ADC1_JOFR2,	0x40012418
.equ	ADC1_JOFR3,	0x4001241C
.equ	ADC1_JOFR4,	0x40012420
.equ	ADC1_HTR,	0x40012424
.equ	ADC1_LTR,	0x40012428
.equ	ADC1_SQR1,	0x4001242C
.equ	ADC1_SQR2,	0x40012430
.equ	ADC1_SQR3,	0x40012434
.equ	ADC1_JSQR,	0x40012438
.equ	ADC1_JDR1,	0x4001243C
.equ	ADC1_JDR2,	0x40012440
.equ	ADC1_JDR3,	0x40012444
.equ	ADC1_JDR4,	0x40012448
.equ	ADC1_DR,	0x4001244C
.equ	ADC2_SR,	0x40012800
.equ	ADC2_CR1,	0x40012804
.equ	ADC2_CR2,	0x40012808
.equ	ADC2_SMPR1,	0x4001280C
.equ	ADC2_SMPR2,	0x40012810
.equ	ADC2_JOFR1,	0x40012814
.equ	ADC2_JOFR2,	0x40012818
.equ	ADC2_JOFR3,	0x4001281C
.equ	ADC2_JOFR4,	0x40012820
.equ	ADC2_HTR,	0x40012824
.equ	ADC2_LTR,	0x40012828
.equ	ADC2_SQR1,	0x4001282C
.equ	ADC2_SQR2,	0x40012830
.equ	ADC2_SQR3,	0x40012834
.equ	ADC2_JSQR,	0x40012838
.equ	ADC2_JDR1,	0x4001283C
.equ	ADC2_JDR2,	0x40012840
.equ	ADC2_JDR3,	0x40012844
.equ	ADC2_JDR4,	0x40012848
.equ	ADC2_DR,	0x4001284C
.equ	ADC3_SR,	0x40013C00
.equ	ADC3_CR1,	0x40013C04
.equ	ADC3_CR2,	0x40013C08
.equ	ADC3_SMPR1,	0x40013C0C
.equ	ADC3_SMPR2,	0x40013C10
.equ	ADC3_JOFR1,	0x40013C14
.equ	ADC3_JOFR2,	0x40013C18
.equ	ADC3_JOFR3,	0x40013C1C
.equ	ADC3_JOFR4,	0x40013C20
.equ	ADC3_HTR,	0x40013C24
.equ	ADC3_LTR,	0x40013C28
.equ	ADC3_SQR1,	0x40013C2C
.equ	ADC3_SQR2,	0x40013C30
.equ	ADC3_SQR3,	0x40013C34
.equ	ADC3_JSQR,	0x40013C38
.equ	ADC3_JDR1,	0x40013C3C
.equ	ADC3_JDR2,	0x40013C40
.equ	ADC3_JDR3,	0x40013C44
.equ	ADC3_JDR4,	0x40013C48
.equ	ADC3_DR,	0x40013C4C
.equ	FSMC_BCR1,	0xA0000000
.equ	FSMC_BTR1,	0xA0000004
.equ	FSMC_BCR2,	0xA0000008
.equ	FSMC_BTR2,	0xA000000C
.equ	FSMC_BCR3,	0xA0000010
.equ	FSMC_BTR3,	0xA0000014
.equ	FSMC_BCR4,	0xA0000018
.equ	FSMC_BTR4,	0xA000001C
.equ	FSMC_PCR2,	0xA0000060
.equ	FSMC_SR2,	0xA0000064
.equ	FSMC_PMEM2,	0xA0000068
.equ	FSMC_PATT2,	0xA000006C
.equ	FSMC_ECCR2,	0xA0000074
.equ	FSMC_PCR3,	0xA0000080
.equ	FSMC_SR3,	0xA0000084
.equ	FSMC_PMEM3,	0xA0000088
.equ	FSMC_PATT3,	0xA000008C
.equ	FSMC_ECCR3,	0xA0000094
.equ	FSMC_PCR4,	0xA00000A0
.equ	FSMC_SR4,	0xA00000A4
.equ	FSMC_PMEM4,	0xA00000A8
.equ	FSMC_PATT4,	0xA00000AC
.equ	FSMC_PIO4,	0xA00000B0
.equ	FSMC_BWTR1,	0xA0000104
.equ	FSMC_BWTR2,	0xA000010C
.equ	FSMC_BWTR3,	0xA0000114
.equ	FSMC_BWTR4,	0xA000011C
.equ	SDIO_POWER,	0x40018000
.equ	SDIO_CLKCR,	0x40018004
.equ	SDIO_ARG,	0x40018008
.equ	SDIO_CMD,	0x4001800C
.equ	SDIO_RESPCMD,	0x40018010
.equ	SDIO_RESP1,	0x40018014
.equ	SDIO_RESP2,	0x40018018
.equ	SDIO_RESP3,	0x4001801C
.equ	SDIO_RESP4,	0x40018020
.equ	SDIO_DTIMER,	0x40018024
.equ	SDIO_DLEN,	0x40018028
.equ	SDIO_DCTRL,	0x4001802C
.equ	SDIO_DCOUNT,	0x40018030
.equ	SDIO_STA,	0x40018034
.equ	SDIO_ICR,	0x40018038
.equ	SDIO_MASK,	0x4001803C
.equ	SDIO_FIFOCNT,	0x40018048
.equ	SDIO_FIFO,	0x40018080
.equ	DAC_CR,	0x40007400
.equ	DAC_SWTRIGR,	0x40007404
.equ	DAC_DHR12R1,	0x40007408
.equ	DAC_DHR12L1,	0x4000740C
.equ	DAC_DHR8R1,	0x40007410
.equ	DAC_DHR12R2,	0x40007414
.equ	DAC_DHR12L2,	0x40007418
.equ	DAC_DHR8R2,	0x4000741C
.equ	DAC_DHR12RD,	0x40007420
.equ	DAC_DHR12LD,	0x40007424
.equ	DAC_DHR8RD,	0x40007428
.equ	DAC_DOR1,	0x4000742C
.equ	DAC_DOR2,	0x40007430
.equ	DBGMCU_IDCODE,	0xE0042000
.equ	DBGMCU_CR,	0xE0042004
.equ	NVIC,	0xE000E004
.equ	SYSTICKCSR,	0xE000E010
.equ	SYSTICKRVR,	0xE000E014
.equ	SYSTICKCVR,	0xE000E018
.equ	SYSTICKCALVR,	0xE000E01C
.equ	SETENA0,	0xE000E100
.equ	SETENA1,	0xE000E104
.equ	CLRENA0,	0xE000E180
.equ	CLRENA1,	0xE000E184
.equ	SETPEND0,	0xE000E200
.equ	SETPEND1,	0xE000E204
.equ	CLRPEND0,	0xE000E280
.equ	CLRPEND1,	0xE000E284
.equ	ACTIVE0,	0xE000E300
.equ	ACTIVE1,	0xE000E304
.equ	IP0,	0xE000E400
.equ	IP1,	0xE000E404
.equ	IP2,	0xE000E408
.equ	IP3,	0xE000E40C
.equ	IP4,	0xE000E410
.equ	IP5,	0xE000E414
.equ	IP6,	0xE000E418
.equ	IP7,	0xE000E41C
.equ	IP8,	0xE000E420
.equ	IP9,	0xE000E424
.equ	IP10,	0xE000E428
.equ	IP11,	0xE000E42C
.equ	IP12,	0xE000E430
.equ	IP13,	0xE000E434
.equ	IP14,	0xE000E438
.equ	IP15,	0xE000E43C
.equ	CPUIDBR,	0xE000ED00
.equ	ICSR,	0xE000ED04
.equ	VTOR,	0xE000ED08
.equ	AITCR,	0xE000ED0C
.equ	SCR,	0xE000ED10
.equ	CCR,	0xE000ED14
.equ	SHPR0,	0xE000ED18
.equ	SHPR1,	0xE000ED1C
.equ	SHPR2,	0xE000ED20
.equ	SHCSR,	0xE000ED24
.equ	CFSR,	0xE000ED28
.equ	HFSR,	0xE000ED2C
.equ	DFSR,	0xE000ED30
.equ	MMFAR,	0xE000ED34
.equ	BFAR,	0xE000ED38
.equ	STIR,	0xE000EF00
.equ	FLASH_ACR,	0x40022000
.equ	FLASH_KEYR,	0x40022004
.equ	FLASH_OPTKEYR,	0x40022008
.equ	FLASH_SR,	0x4002200C
.equ	FLASH_CR,	0x40022010
.equ	FLASH_AR,	0x40022014
.equ	FLASH_OBR,	0x4002201C
.equ	FLASH_WRPR,	0x40022020

@ Peripheral Registers_Bits_Definition

