Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
@ Bit definition for CRC_DR register
.equ	CRC_DR_DR,	0xFFFFFFFF @ Data register bits


@ Bit definition for CRC_IDR register
.equ	CRC_IDR_IDR,	0xFF @ General-purpose 8-bit data register bits


@ Bit definition for CRC_CR register
.equ	CRC_CR_RESET,	0x01 @ RESET bit


@
@ Power Control
@


@ Bit definition for PWR_CR register
.equ	PWR_CR_LPDS,	0x0001 @ Low-Power Deepsleep
.equ	PWR_CR_PDDS,	0x0002 @ Power Down Deepsleep
.equ	PWR_CR_CWUF,	0x0004 @ Clear Wakeup Flag
.equ	PWR_CR_CSBF,	0x0008 @ Clear Standby Flag
.equ	PWR_CR_PVDE,	0x0010 @ Power Voltage Detector Enable

.equ	PWR_CR_PLS,	0x00E0	@ PLS[2:0] bits (PVD Level Selection)
.equ	PWR_CR_PLS_0,	0x0020	@ Bit 0
.equ	PWR_CR_PLS_1,	0x0040	@ Bit 1
.equ	PWR_CR_PLS_2,	0x0080	@ Bit 2

@ PVD level configuration
.equ	PWR_CR_PLS_2V2,	0x0000	@ PVD level 2.2V
.equ	PWR_CR_PLS_2V3,	0x0020	@ PVD level 2.3V
.equ	PWR_CR_PLS_2V4,	0x0040	@ PVD level 2.4V
.equ	PWR_CR_PLS_2V5,	0x0060	@ PVD level 2.5V
.equ	PWR_CR_PLS_2V6,	0x0080	@ PVD level 2.6V
.equ	PWR_CR_PLS_2V7,	0x00A0	@ PVD level 2.7V
.equ	PWR_CR_PLS_2V8,	0x00C0	@ PVD level 2.8V
.equ	PWR_CR_PLS_2V9,	0x00E0	@ PVD level 2.9V

.equ	PWR_CR_DBP,	0x0100	@ Disable Backup Domain write protection


@ Bit definition for PWR_CSR register
.equ	PWR_CSR_WUF,	0x0001	@ Wakeup Flag
.equ	PWR_CSR_SBF,	0x0002	@ Standby Flag
.equ	PWR_CSR_PVDO,	0x0004	@ PVD Output
.equ	PWR_CSR_EWUP,	0x0100	@ Enable WKUP pin


@
@ Backup registers
@


@ Bit definition for BKP_DR1 register
.equ	BKP_DR1_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR2 register
.equ	BKP_DR2_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR3 register
.equ	BKP_DR3_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR4 register
.equ	BKP_DR4_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR5 register
.equ	BKP_DR5_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR6 register
.equ	BKP_DR6_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR7 register
.equ	BKP_DR7_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR8 register
.equ	BKP_DR8_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR9 register
.equ	BKP_DR9_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR10 register
.equ	BKP_DR10_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR11 register
.equ	BKP_DR11_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR12 register
.equ	BKP_DR12_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR13 register
.equ	BKP_DR13_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR14 register
.equ	BKP_DR14_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR15 register
.equ	BKP_DR15_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR16 register
.equ	BKP_DR16_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR17 register
.equ	BKP_DR17_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR18 register
.equ	BKP_DR18_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR19 register
.equ	BKP_DR19_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR20 register
.equ	BKP_DR20_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR21 register
.equ	BKP_DR21_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR22 register
.equ	BKP_DR22_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR23 register
.equ	BKP_DR23_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR24 register
.equ	BKP_DR24_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR25 register
.equ	BKP_DR25_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR26 register
.equ	BKP_DR26_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR27 register
.equ	BKP_DR27_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR28 register
.equ	BKP_DR28_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR29 register
.equ	BKP_DR29_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR30 register
.equ	BKP_DR30_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR31 register
.equ	BKP_DR31_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR32 register
.equ	BKP_DR32_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR33 register
.equ	BKP_DR33_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR34 register
.equ	BKP_DR34_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR35 register
.equ	BKP_DR35_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR36 register
.equ	BKP_DR36_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR37 register
.equ	BKP_DR37_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR38 register
.equ	BKP_DR38_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR39 register
.equ	BKP_DR39_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR40 register
.equ	BKP_DR40_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR41 register
.equ	BKP_DR41_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_DR42 register
.equ	BKP_DR42_D,	0xFFFF	@ Backup data

@ Bit definition for BKP_RTCCR register
.equ	BKP_RTCCR_CAL,	0x007F	@ Calibration value
.equ	BKP_RTCCR_CCO,	0x0080	@ Calibration Clock Output
.equ	BKP_RTCCR_ASOE,	0x0100	@ Alarm or Second Output Enable
.equ	BKP_RTCCR_ASOS,	0x0200	@ Alarm or Second Output Selection

@ Bit definition for BKP_CR register
.equ	BKP_CR_TPE,	0x01	@ TAMPER pin enable
.equ	BKP_CR_TPAL,	0x02	@ TAMPER pin active level

@ Bit definition for BKP_CSR register
.equ	BKP_CSR_CTE,	0x0001	@ Clear Tamper event
.equ	BKP_CSR_CTI,	0x0002	@ Clear Tamper Interrupt
.equ	BKP_CSR_TPIE,	0x0004	@ TAMPER Pin interrupt enable
.equ	BKP_CSR_TEF,	0x0100	@ Tamper Event Flag
.equ	BKP_CSR_TIF,	0x0200	@ Tamper Interrupt Flag


@
@ Reset and Clock Control
@


@ Bit definition for RCC_CR register
.equ	RCC_CR_HSION,	0x00000001	@ Internal High Speed clock enable
.equ	RCC_CR_HSIRDY,	0x00000002	@ Internal High Speed clock ready flag
.equ	RCC_CR_HSITRIM,	0x000000F8	@ Internal High Speed clock trimming
.equ	RCC_CR_HSICAL,	0x0000FF00	@ Internal High Speed clock Calibration
.equ	RCC_CR_HSEON,	0x00010000	@ External High Speed clock enable
.equ	RCC_CR_HSERDY,	0x00020000	@ External High Speed clock ready flag
.equ	RCC_CR_HSEBYP,	0x00040000	@ External High Speed clock Bypass
.equ	RCC_CR_CSSON,	0x00080000	@ Clock Security System enable
.equ	RCC_CR_PLLON,	0x01000000	@ PLL enable
.equ	RCC_CR_PLLRDY,	0x02000000	@ PLL clock ready flag

.equ	RCC_CR_PLL2ON,	0x04000000	@ PLL2 enable
.equ	RCC_CR_PLL2RDY,	0x08000000	@ PLL2 clock ready flag
.equ	RCC_CR_PLL3ON,	0x10000000	@ PLL3 enable
.equ	RCC_CR_PLL3RDY,	0x20000000	@ PLL3 clock ready flag

