Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
.ifdef STM32F10X_HD
.equ	RCC_APB2ENR_IOPFEN,	0x0080	@ I/O port F clock enable
.equ	RCC_APB2ENR_IOPGEN,	0x0100	@ I/O port G clock enable
.equ	RCC_APB2ENR_TIM8EN,	0x2000	@ TIM8 Timer clock enable
.equ	RCC_APB2ENR_ADC3EN,	0x8000	@ DMA1 clock enable
.endif

@ Bit definition for RCC_APB1ENR register
.equ	RCC_APB1ENR_TIM2EN,	0x00000001	@ Timer 2 clock enabled
.equ	RCC_APB1ENR_TIM3EN,	0x00000002	@ Timer 3 clock enable
.equ	RCC_APB1ENR_WWDGEN,	0x00000800	@ Window Watchdog clock enable
.equ	RCC_APB1ENR_USART2EN,	0x00020000	@ USART 2 clock enable
.equ	RCC_APB1ENR_I2C1EN,	0x00200000	@ I2C 1 clock enable
.equ	RCC_APB1ENR_CAN1EN,	0x02000000	@ CAN1 clock enable
.equ	RCC_APB1ENR_BKPEN,	0x08000000	@ Backup interface clock enable
.equ	RCC_APB1ENR_PWREN,	0x10000000	@ Power interface clock enable

.ifdef STM32F10X_LD
.equ	RCC_APB1ENR_TIM4EN,	0x00000004	@ Timer 4 clock enable
.equ	RCC_APB1ENR_SPI2EN,	0x00004000	@ SPI 2 clock enable
.equ	RCC_APB1ENR_USART3EN,	0x00040000	@ USART 3 clock enable
.equ	RCC_APB1ENR_I2C2EN,	0x00400000	@ I2C 2 clock enable
.endif

#if defined(STM32F10X_HD) || defined(STM32F10X_MD) || defined(STM32F10X_LD)
.equ	RCC_APB1ENR_USBEN,	0x00800000	@ USB Device clock enable
#endif

#if defined(STM32F10X_HD) || defined(STM32F10X_CL)
.equ	RCC_APB1ENR_TIM5EN,	0x00000008	@ Timer 5 clock enable
.equ	RCC_APB1ENR_TIM6EN,	0x00000010	@ Timer 6 clock enable
.equ	RCC_APB1ENR_TIM7EN,	0x00000020	@ Timer 7 clock enable
.equ	RCC_APB1ENR_SPI3EN,	0x00008000	@ SPI 3 clock enable
.equ	RCC_APB1ENR_UART4EN,	0x00080000	@ UART 4 clock enable
.equ	RCC_APB1ENR_UART5EN,	0x00100000	@ UART 5 clock enable
.equ	RCC_APB1ENR_DACEN,	0x20000000	@ DAC interface clock enable
#endif

.ifdef STM32F10X_CL
.equ	RCC_APB1ENR_CAN2EN,	0x08000000	@ CAN2 clock enable
.endif

@ Bit definition for RCC_BDCR register
.equ	RCC_BDCR_LSEON,	0x00000001	@ External Low Speed oscillator enable
.equ	RCC_BDCR_LSERDY,	0x00000002	@ External Low Speed oscillator Ready
.equ	RCC_BDCR_LSEBYP,	0x00000004	@ External Low Speed oscillator Bypass

.equ	RCC_BDCR_RTCSEL,	0x00000300	@ RTCSEL[1:0] bits (RTC clock source selection)
.equ	RCC_BDCR_RTCSEL_0,	0x00000100	@ Bit 0
.equ	RCC_BDCR_RTCSEL_1,	0x00000200	@ Bit 1

@ RTC congiguration
.equ	RCC_BDCR_RTCSEL_NOCLOCK,	0x00000000	@ No clock
.equ	RCC_BDCR_RTCSEL_LSE,	0x00000100	@ LSE oscillator clock used as RTC clock
.equ	RCC_BDCR_RTCSEL_LSI,	0x00000200	@ LSI oscillator clock used as RTC clock
.equ	RCC_BDCR_RTCSEL_HSE,	0x00000300	@ HSE oscillator clock divided by 128 used as RTC clock

.equ	RCC_BDCR_RTCEN,	0x00008000	@ RTC clock enable
.equ	RCC_BDCR_BDRST,	0x00010000	@ Backup domain software reset

@ Bit definition for RCC_CSR register
.equ	RCC_CSR_LSION,	0x00000001	@ Internal Low Speed oscillator enable
.equ	RCC_CSR_LSIRDY,	0x00000002	@ Internal Low Speed oscillator Ready
.equ	RCC_CSR_RMVF,	0x01000000	@ Remove reset flag
.equ	RCC_CSR_PINRSTF,	0x04000000	@ PIN reset flag
.equ	RCC_CSR_PORRSTF,	0x08000000	@ POR/PDR reset flag
.equ	RCC_CSR_SFTRSTF,	0x10000000	@ Software Reset flag
.equ	RCC_CSR_IWDGRSTF,	0x20000000	@ Independent Watchdog reset flag
.equ	RCC_CSR_WWDGRSTF,	0x40000000	@ Window watchdog reset flag
.equ	RCC_CSR_LPWRRSTF,	0x80000000	@ Low-Power reset flag

.ifdef STM32F10X_CL
@ Bit definition for RCC_AHBRSTR register
.equ	RCC_AHBRSTR_OTGFSRST,	0x00001000	@ USB OTG FS reset
.equ	RCC_AHBRSTR_ETHMACRST,	0x00004000	@ ETHERNET MAC reset

@ Bit definition for RCC_CFGR2 register
@ PREDIV1 configuration
.equ	RCC_CFGR2_PREDIV1,	0x0000000F	@ PREDIV1[3:0] bits
.equ	RCC_CFGR2_PREDIV1_0,	0x00000001	@ Bit 0
.equ	RCC_CFGR2_PREDIV1_1,	0x00000002	@ Bit 1
.equ	RCC_CFGR2_PREDIV1_2,	0x00000004	@ Bit 2
.equ	RCC_CFGR2_PREDIV1_3,	0x00000008	@ Bit 3

.equ	RCC_CFGR2_PREDIV1_DIV1,	0x00000000	@ PREDIV1 input clock not divided
.equ	RCC_CFGR2_PREDIV1_DIV2,	0x00000001	@ PREDIV1 input clock divided by 2
.equ	RCC_CFGR2_PREDIV1_DIV3,	0x00000002	@ PREDIV1 input clock divided by 3
.equ	RCC_CFGR2_PREDIV1_DIV4,	0x00000003	@ PREDIV1 input clock divided by 4
.equ	RCC_CFGR2_PREDIV1_DIV5,	0x00000004	@ PREDIV1 input clock divided by 5
.equ	RCC_CFGR2_PREDIV1_DIV6,	0x00000005	@ PREDIV1 input clock divided by 6
.equ	RCC_CFGR2_PREDIV1_DIV7,	0x00000006	@ PREDIV1 input clock divided by 7
.equ	RCC_CFGR2_PREDIV1_DIV8,	0x00000007	@ PREDIV1 input clock divided by 8
.equ	RCC_CFGR2_PREDIV1_DIV9,	0x00000008	@ PREDIV1 input clock divided by 9
.equ	RCC_CFGR2_PREDIV1_DIV10,	0x00000009	@ PREDIV1 input clock divided by 10
.equ	RCC_CFGR2_PREDIV1_DIV11,	0x0000000A	@ PREDIV1 input clock divided by 11
.equ	RCC_CFGR2_PREDIV1_DIV12,	0x0000000B	@ PREDIV1 input clock divided by 12
.equ	RCC_CFGR2_PREDIV1_DIV13,	0x0000000C	@ PREDIV1 input clock divided by 13
.equ	RCC_CFGR2_PREDIV1_DIV14,	0x0000000D	@ PREDIV1 input clock divided by 14
.equ	RCC_CFGR2_PREDIV1_DIV15,	0x0000000E	@ PREDIV1 input clock divided by 15
.equ	RCC_CFGR2_PREDIV1_DIV16,	0x0000000F	@ PREDIV1 input clock divided by 16

@ PREDIV2 configuration
.equ	RCC_CFGR2_PREDIV2,	0x000000F0	@ PREDIV2[3:0] bits
.equ	RCC_CFGR2_PREDIV2_0,	0x00000010	@ Bit 0
.equ	RCC_CFGR2_PREDIV2_1,	0x00000020	@ Bit 1
.equ	RCC_CFGR2_PREDIV2_2,	0x00000040	@ Bit 2
.equ	RCC_CFGR2_PREDIV2_3,	0x00000080	@ Bit 3

.equ	RCC_CFGR2_PREDIV2_DIV1,	0x00000000	@ PREDIV2 input clock not divided
.equ	RCC_CFGR2_PREDIV2_DIV2,	0x00000010	@ PREDIV2 input clock divided by 2
.equ	RCC_CFGR2_PREDIV2_DIV3,	0x00000020	@ PREDIV2 input clock divided by 3
.equ	RCC_CFGR2_PREDIV2_DIV4,	0x00000030	@ PREDIV2 input clock divided by 4
.equ	RCC_CFGR2_PREDIV2_DIV5,	0x00000040	@ PREDIV2 input clock divided by 5
.equ	RCC_CFGR2_PREDIV2_DIV6,	0x00000050	@ PREDIV2 input clock divided by 6
.equ	RCC_CFGR2_PREDIV2_DIV7,	0x00000060	@ PREDIV2 input clock divided by 7
.equ	RCC_CFGR2_PREDIV2_DIV8,	0x00000070	@ PREDIV2 input clock divided by 8
.equ	RCC_CFGR2_PREDIV2_DIV9,	0x00000080	@ PREDIV2 input clock divided by 9
.equ	RCC_CFGR2_PREDIV2_DIV10,	0x00000090	@ PREDIV2 input clock divided by 10
.equ	RCC_CFGR2_PREDIV2_DIV11,	0x000000A0	@ PREDIV2 input clock divided by 11
.equ	RCC_CFGR2_PREDIV2_DIV12,	0x000000B0	@ PREDIV2 input clock divided by 12
.equ	RCC_CFGR2_PREDIV2_DIV13,	0x000000C0	@ PREDIV2 input clock divided by 13
.equ	RCC_CFGR2_PREDIV2_DIV14,	0x000000D0	@ PREDIV2 input clock divided by 14
.equ	RCC_CFGR2_PREDIV2_DIV15,	0x000000E0	@ PREDIV2 input clock divided by 15
.equ	RCC_CFGR2_PREDIV2_DIV16,	0x000000F0	@ PREDIV2 input clock divided by 16

@ PLL2MUL configuration
.equ	RCC_CFGR2_PLL2MUL,	0x00000F00	@ PLL2MUL[3:0] bits
.equ	RCC_CFGR2_PLL2MUL_0,	0x00000100	@ Bit 0
.equ	RCC_CFGR2_PLL2MUL_1,	0x00000200	@ Bit 1
.equ	RCC_CFGR2_PLL2MUL_2,	0x00000400	@ Bit 2
.equ	RCC_CFGR2_PLL2MUL_3,	0x00000800	@ Bit 3

.equ	RCC_CFGR2_PLL2MUL8,	0x00000600	@ PLL2 input clock * 8
.equ	RCC_CFGR2_PLL2MUL9,	0x00000700	@ PLL2 input clock * 9
.equ	RCC_CFGR2_PLL2MUL10,	0x00000800	@ PLL2 input clock * 10
.equ	RCC_CFGR2_PLL2MUL11,	0x00000900	@ PLL2 input clock * 11
.equ	RCC_CFGR2_PLL2MUL12,	0x00000A00	@ PLL2 input clock * 12
.equ	RCC_CFGR2_PLL2MUL13,	0x00000B00	@ PLL2 input clock * 13
.equ	RCC_CFGR2_PLL2MUL14,	0x00000C00	@ PLL2 input clock * 14
.equ	RCC_CFGR2_PLL2MUL16,	0x00000E00	@ PLL2 input clock * 16
.equ	RCC_CFGR2_PLL2MUL20,	0x00000F00	@ PLL2 input clock * 20

@ PLL3MUL configuration
.equ	RCC_CFGR2_PLL3MUL,	0x0000F000	@ PLL3MUL[3:0] bits
.equ	RCC_CFGR2_PLL3MUL_0,	0x00001000	@ Bit 0
.equ	RCC_CFGR2_PLL3MUL_1,	0x00002000	@ Bit 1
.equ	RCC_CFGR2_PLL3MUL_2,	0x00004000	@ Bit 2
.equ	RCC_CFGR2_PLL3MUL_3,	0x00008000	@ Bit 3

