Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
@ Bit definition for NVIC_PRI0 register
.equ	NVIC_IPR0_PRI_0,	0x000000FF	@ Priority of interrupt 0
.equ	NVIC_IPR0_PRI_1,	0x0000FF00	@ Priority of interrupt 1
.equ	NVIC_IPR0_PRI_2,	0x00FF0000	@ Priority of interrupt 2
.equ	NVIC_IPR0_PRI_3,	0xFF000000	@ Priority of interrupt 3

@ Bit definition for NVIC_PRI1 register
.equ	NVIC_IPR1_PRI_4,	0x000000FF	@ Priority of interrupt 4
.equ	NVIC_IPR1_PRI_5,	0x0000FF00	@ Priority of interrupt 5
.equ	NVIC_IPR1_PRI_6,	0x00FF0000	@ Priority of interrupt 6
.equ	NVIC_IPR1_PRI_7,	0xFF000000	@ Priority of interrupt 7

@ Bit definition for NVIC_PRI2 register
.equ	NVIC_IPR2_PRI_8,	0x000000FF	@ Priority of interrupt 8
.equ	NVIC_IPR2_PRI_9,	0x0000FF00	@ Priority of interrupt 9
.equ	NVIC_IPR2_PRI_10,	0x00FF0000	@ Priority of interrupt 10
.equ	NVIC_IPR2_PRI_11,	0xFF000000	@ Priority of interrupt 11

@ Bit definition for NVIC_PRI3 register
.equ	NVIC_IPR3_PRI_12,	0x000000FF	@ Priority of interrupt 12
.equ	NVIC_IPR3_PRI_13,	0x0000FF00	@ Priority of interrupt 13
.equ	NVIC_IPR3_PRI_14,	0x00FF0000	@ Priority of interrupt 14
.equ	NVIC_IPR3_PRI_15,	0xFF000000	@ Priority of interrupt 15

@ Bit definition for NVIC_PRI4 register
.equ	NVIC_IPR4_PRI_16,	0x000000FF	@ Priority of interrupt 16
.equ	NVIC_IPR4_PRI_17,	0x0000FF00	@ Priority of interrupt 17
.equ	NVIC_IPR4_PRI_18,	0x00FF0000	@ Priority of interrupt 18
.equ	NVIC_IPR4_PRI_19,	0xFF000000	@ Priority of interrupt 19

@ Bit definition for NVIC_PRI5 register
.equ	NVIC_IPR5_PRI_20,	0x000000FF	@ Priority of interrupt 20
.equ	NVIC_IPR5_PRI_21,	0x0000FF00	@ Priority of interrupt 21
.equ	NVIC_IPR5_PRI_22,	0x00FF0000	@ Priority of interrupt 22
.equ	NVIC_IPR5_PRI_23,	0xFF000000	@ Priority of interrupt 23

@ Bit definition for NVIC_PRI6 register
.equ	NVIC_IPR6_PRI_24,	0x000000FF	@ Priority of interrupt 24
.equ	NVIC_IPR6_PRI_25,	0x0000FF00	@ Priority of interrupt 25
.equ	NVIC_IPR6_PRI_26,	0x00FF0000	@ Priority of interrupt 26
.equ	NVIC_IPR6_PRI_27,	0xFF000000	@ Priority of interrupt 27

@ Bit definition for NVIC_PRI7 register
.equ	NVIC_IPR7_PRI_28,	0x000000FF	@ Priority of interrupt 28
.equ	NVIC_IPR7_PRI_29,	0x0000FF00	@ Priority of interrupt 29
.equ	NVIC_IPR7_PRI_30,	0x00FF0000	@ Priority of interrupt 30
.equ	NVIC_IPR7_PRI_31,	0xFF000000	@ Priority of interrupt 31

@ Bit definition for SCB_CPUID register
.equ	SCB_CPUID_REVISION,	0x0000000F	@ Implementation defined revision number
.equ	SCB_CPUID_PARTNO,	0x0000FFF0	@ Number of processor within family
.equ	SCB_CPUID_Constant,	0x000F0000	@ Reads as 0x0F
.equ	SCB_CPUID_VARIANT,	0x00F00000	@ Implementation defined variant number
.equ	SCB_CPUID_IMPLEMENTER,	0xFF000000	@ Implementer code. ARM is 0x41

@ Bit definition for SCB_ICSR register
.equ	SCB_ICSR_VECTACTIVE,	0x000001FF	@ Active ISR number field
.equ	SCB_ICSR_RETTOBASE,	0x00000800	@ All active exceptions minus the IPSR_current_exception yields the empty set
.equ	SCB_ICSR_VECTPENDING,	0x003FF000	@ Pending ISR number field
.equ	SCB_ICSR_ISRPENDING,	0x00400000	@ Interrupt pending flag
.equ	SCB_ICSR_ISRPREEMPT,	0x00800000	@ It indicates that a pending interrupt becomes active in the next running cycle
.equ	SCB_ICSR_PENDSTCLR,	0x02000000	@ Clear pending SysTick bit
.equ	SCB_ICSR_PENDSTSET,	0x04000000	@ Set pending SysTick bit
.equ	SCB_ICSR_PENDSVCLR,	0x08000000	@ Clear pending pendSV bit
.equ	SCB_ICSR_PENDSVSET,	0x10000000	@ Set pending pendSV bit
.equ	SCB_ICSR_NMIPENDSET,	0x80000000	@ Set pending NMI bit

@ Bit definition for SCB_VTOR register
.equ	SCB_VTOR_TBLOFF,	0x1FFFFF80	@ Vector table base offset field
.equ	SCB_VTOR_TBLBASE,	0x20000000	@ Table base in code(0) or RAM(1)

@ * Bit definition for SCB_AIRCR register
.equ	SCB_AIRCR_VECTRESET,	0x00000001	@ System Reset bit
.equ	SCB_AIRCR_VECTCLRACTIVE,	0x00000002	@ Clear active vector bit
.equ	SCB_AIRCR_SYSRESETREQ,	0x00000004	@ Requests chip control logic to generate a reset

.equ	SCB_AIRCR_PRIGROUP,	0x00000700	@ PRIGROUP[2:0] bits (Priority group)
.equ	SCB_AIRCR_PRIGROUP_0,	0x00000100	@ Bit 0
.equ	SCB_AIRCR_PRIGROUP_1,	0x00000200	@ Bit 1
.equ	SCB_AIRCR_PRIGROUP_2,	0x00000400	@ Bit 2

@ prority group configuration
.equ	SCB_AIRCR_PRIGROUP0,	0x00000000	@ Priority group=0 (7 bits of pre-emption priority, 1 bit of subpriority)
.equ	SCB_AIRCR_PRIGROUP1,	0x00000100	@ Priority group=1 (6 bits of pre-emption priority, 2 bits of subpriority)
.equ	SCB_AIRCR_PRIGROUP2,	0x00000200	@ Priority group=2 (5 bits of pre-emption priority, 3 bits of subpriority)
.equ	SCB_AIRCR_PRIGROUP3,	0x00000300	@ Priority group=3 (4 bits of pre-emption priority, 4 bits of subpriority)
.equ	SCB_AIRCR_PRIGROUP4,	0x00000400	@ Priority group=4 (3 bits of pre-emption priority, 5 bits of subpriority)
.equ	SCB_AIRCR_PRIGROUP5,	0x00000500	@ Priority group=5 (2 bits of pre-emption priority, 6 bits of subpriority)
.equ	SCB_AIRCR_PRIGROUP6,	0x00000600	@ Priority group=6 (1 bit of pre-emption priority, 7 bits of subpriority)
.equ	SCB_AIRCR_PRIGROUP7,	0x00000700	@ Priority group=7 (no pre-emption priority, 8 bits of subpriority)

.equ	SCB_AIRCR_ENDIANESS,	0x00008000	@ Data endianness bit
.equ	SCB_AIRCR_VECTKEY,	0xFFFF0000	@ Register key (VECTKEY) - Reads as 0xFA05 (VECTKEYSTAT)

@ Bit definition for SCB_SCR register
.equ	SCB_SCR_SLEEPONEXIT,	0x02	@ Sleep on exit bit
.equ	SCB_SCR_SLEEPDEEP,	0x04	@ Sleep deep bit
.equ	SCB_SCR_SEVONPEND,	0x10	@ Wake up from WFE

@ Bit definition for SCB_CCR register
.equ	SCB_CCR_NONBASETHRDENA,	0x0001	@ Thread mode can be entered from any level in Handler mode by controlled return value
.equ	SCB_CCR_USERSETMPEND,	0x0002	@ Enables user code to write the Software Trigger Interrupt register to trigger (pend) a Main exception
.equ	SCB_CCR_UNALIGN_TRP,	0x0008	@ Trap for unaligned access
.equ	SCB_CCR_DIV_0_TRP,	0x0010	@ Trap on Divide by 0
.equ	SCB_CCR_BFHFNMIGN,	0x0100	@ Handlers running at priority -1 and -2
.equ	SCB_CCR_STKALIGN,	0x0200	@ On exception entry, the SP used prior to the exception is adjusted to be 8-byte aligned

@ Bit definition for SCB_SHPR register
.equ	SCB_SHPR_PRI_N,	0x000000FF	@ Priority of system handler 4,8, and 12. Mem Manage, reserved and Debug Monitor
.equ	SCB_SHPR_PRI_N1,	0x0000FF00	@ Priority of system handler 5,9, and 13. Bus Fault, reserved and reserved
.equ	SCB_SHPR_PRI_N2,	0x00FF0000	@ Priority of system handler 6,10, and 14. Usage Fault, reserved and PendSV
.equ	SCB_SHPR_PRI_N3,	0xFF000000	@ Priority of system handler 7,11, and 15. Reserved, SVCall and SysTick

@ Bit definition for SCB_SHCSR register
.equ	SCB_SHCSR_MEMFAULTACT,	0x00000001	@ MemManage is active
.equ	SCB_SHCSR_BUSFAULTACT,	0x00000002	@ BusFault is active
.equ	SCB_SHCSR_USGFAULTACT,	0x00000008	@ UsageFault is active
.equ	SCB_SHCSR_SVCALLACT,	0x00000080	@ SVCall is active
.equ	SCB_SHCSR_MONITORACT,	0x00000100	@ Monitor is active
.equ	SCB_SHCSR_PENDSVACT,	0x00000400	@ PendSV is active
.equ	SCB_SHCSR_SYSTICKACT,	0x00000800	@ SysTick is active
.equ	SCB_SHCSR_USGFAULTPENDED,	0x00001000	@ Usage Fault is pended
.equ	SCB_SHCSR_MEMFAULTPENDED,	0x00002000	@ MemManage is pended
.equ	SCB_SHCSR_BUSFAULTPENDED,	0x00004000	@ Bus Fault is pended
.equ	SCB_SHCSR_SVCALLPENDED,	0x00008000	@ SVCall is pended
.equ	SCB_SHCSR_MEMFAULTENA,	0x00010000	@ MemManage enable
.equ	SCB_SHCSR_BUSFAULTENA,	0x00020000	@ Bus Fault enable
.equ	SCB_SHCSR_USGFAULTENA,	0x00040000	@ UsageFault enable

@ Bit definition for SCB_CFSR register
@ MFSR
.equ	SCB_CFSR_IACCVIOL,	0x00000001	@ Instruction access violation
.equ	SCB_CFSR_DACCVIOL,	0x00000002	@ Data access violation
.equ	SCB_CFSR_MUNSTKERR,	0x00000008	@ Unstacking error
.equ	SCB_CFSR_MSTKERR,	0x00000010	@ Stacking error
.equ	SCB_CFSR_MMARVALID,	0x00000080	@ Memory Manage Address Register address valid flag
@ BFSR
.equ	SCB_CFSR_IBUSERR,	0x00000100	@ Instruction bus error flag
.equ	SCB_CFSR_PRECISERR,	0x00000200	@ Precise data bus error
.equ	SCB_CFSR_IMPRECISERR,	0x00000400	@ Imprecise data bus error
.equ	SCB_CFSR_UNSTKERR,	0x00000800	@ Unstacking error
.equ	SCB_CFSR_STKERR,	0x00001000	@ Stacking error
.equ	SCB_CFSR_BFARVALID,	0x00008000	@ Bus Fault Address Register address valid flag
@ UFSR
.equ	SCB_CFSR_UNDEFINSTR,	0x00010000	@ The processor attempt to excecute an undefined instruction
.equ	SCB_CFSR_INVSTATE,	0x00020000	@ Invalid combination of EPSR and instruction
.equ	SCB_CFSR_INVPC,	0x00040000	@ Attempt to load EXC_RETURN into pc illegally
.equ	SCB_CFSR_NOCP,	0x00080000	@ Attempt to use a coprocessor instruction
.equ	SCB_CFSR_UNALIGNED,	0x01000000	@ Fault occurs when there is an attempt to make an unaligned memory access
.equ	SCB_CFSR_DIVBYZERO,	0x02000000	@ Fault occurs when SDIV or DIV instruction is used with a divisor of 0

@ Bit definition for SCB_HFSR register
.equ	SCB_HFSR_VECTTBL,	0x00000002	@ Fault occures because of vector table read on exception processing
.equ	SCB_HFSR_FORCED,	0x40000000	@ Hard Fault activated when a configurable Fault was received and cannot activate
.equ	SCB_HFSR_DEBUGEVT,	0x80000000	@ Fault related to debug

@ Bit definition for SCB_DFSR register
.equ	SCB_DFSR_HALTED,	0x01	@ Halt request flag
.equ	SCB_DFSR_BKPT,	0x02	@ BKPT flag
.equ	SCB_DFSR_DWTTRAP,	0x04	@ Data Watchpoint and Trace (DWT) flag
.equ	SCB_DFSR_VCATCH,	0x08	@ Vector catch flag
.equ	SCB_DFSR_EXTERNAL,	0x10	@ External debug request flag

@ Bit definition for SCB_MMFAR register
.equ	SCB_MMFAR_ADDRESS,	0xFFFFFFFF	@ Mem Manage fault address field

@ Bit definition for SCB_BFAR register
.equ	SCB_BFAR_ADDRESS,	0xFFFFFFFF	@ Bus fault address field

@ Bit definition for SCB_afsr register
.equ	SCB_AFSR_IMPDEF,	0xFFFFFFFF	@ Implementation defined


@
@ External Interrupt/Event Controller
@


@ Bit definition for EXTI_IMR register
.equ	EXTI_IMR_MR0,	0x00000001	@ Interrupt Mask on line 0
.equ	EXTI_IMR_MR1,	0x00000002	@ Interrupt Mask on line 1
.equ	EXTI_IMR_MR2,	0x00000004	@ Interrupt Mask on line 2
.equ	EXTI_IMR_MR3,	0x00000008	@ Interrupt Mask on line 3
.equ	EXTI_IMR_MR4,	0x00000010	@ Interrupt Mask on line 4
.equ	EXTI_IMR_MR5,	0x00000020	@ Interrupt Mask on line 5
.equ	EXTI_IMR_MR6,	0x00000040	@ Interrupt Mask on line 6
.equ	EXTI_IMR_MR7,	0x00000080	@ Interrupt Mask on line 7
.equ	EXTI_IMR_MR8,	0x00000100	@ Interrupt Mask on line 8
.equ	EXTI_IMR_MR9,	0x00000200	@ Interrupt Mask on line 9
.equ	EXTI_IMR_MR10,	0x00000400	@ Interrupt Mask on line 10
.equ	EXTI_IMR_MR11,	0x00000800	@ Interrupt Mask on line 11
.equ	EXTI_IMR_MR12,	0x00001000	@ Interrupt Mask on line 12
.equ	EXTI_IMR_MR13,	0x00002000	@ Interrupt Mask on line 13
.equ	EXTI_IMR_MR14,	0x00004000	@ Interrupt Mask on line 14
.equ	EXTI_IMR_MR15,	0x00008000	@ Interrupt Mask on line 15
.equ	EXTI_IMR_MR16,	0x00010000	@ Interrupt Mask on line 16
.equ	EXTI_IMR_MR17,	0x00020000	@ Interrupt Mask on line 17
.equ	EXTI_IMR_MR18,	0x00040000	@ Interrupt Mask on line 18
.equ	EXTI_IMR_MR19,	0x00080000	@ Interrupt Mask on line 19

@ Bit definition for EXTI_EMR register
.equ	EXTI_EMR_MR0,	0x00000001	@ Event Mask on line 0
.equ	EXTI_EMR_MR1,	0x00000002	@ Event Mask on line 1
.equ	EXTI_EMR_MR2,	0x00000004	@ Event Mask on line 2
.equ	EXTI_EMR_MR3,	0x00000008	@ Event Mask on line 3
.equ	EXTI_EMR_MR4,	0x00000010	@ Event Mask on line 4
.equ	EXTI_EMR_MR5,	0x00000020	@ Event Mask on line 5
.equ	EXTI_EMR_MR6,	0x00000040	@ Event Mask on line 6
.equ	EXTI_EMR_MR7,	0x00000080	@ Event Mask on line 7
.equ	EXTI_EMR_MR8,	0x00000100	@ Event Mask on line 8
.equ	EXTI_EMR_MR9,	0x00000200	@ Event Mask on line 9
.equ	EXTI_EMR_MR10,	0x00000400	@ Event Mask on line 10
.equ	EXTI_EMR_MR11,	0x00000800	@ Event Mask on line 11
.equ	EXTI_EMR_MR12,	0x00001000	@ Event Mask on line 12
.equ	EXTI_EMR_MR13,	0x00002000	@ Event Mask on line 13
.equ	EXTI_EMR_MR14,	0x00004000	@ Event Mask on line 14
.equ	EXTI_EMR_MR15,	0x00008000	@ Event Mask on line 15
.equ	EXTI_EMR_MR16,	0x00010000	@ Event Mask on line 16
.equ	EXTI_EMR_MR17,	0x00020000	@ Event Mask on line 17
.equ	EXTI_EMR_MR18,	0x00040000	@ Event Mask on line 18
.equ	EXTI_EMR_MR19,	0x00080000	@ Event Mask on line 19

