Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
@ Bit definition for DMA_CNDTR2 register
.equ	DMA_CNDTR2_NDT,	0xFFFF	@ Number of data to Transfer

@ Bit definition for DMA_CNDTR3 register
.equ	DMA_CNDTR3_NDT,	0xFFFF	@ Number of data to Transfer

@ Bit definition for DMA_CNDTR4 register
.equ	DMA_CNDTR4_NDT,	0xFFFF	@ Number of data to Transfer

@ Bit definition for DMA_CNDTR5 register
.equ	DMA_CNDTR5_NDT,	0xFFFF	@ Number of data to Transfer

@ Bit definition for DMA_CNDTR6 register
.equ	DMA_CNDTR6_NDT,	0xFFFF	@ Number of data to Transfer

@ Bit definition for DMA_CNDTR7 register
.equ	DMA_CNDTR7_NDT,	0xFFFF	@ Number of data to Transfer

@ Bit definition for DMA_CPAR1 register
.equ	DMA_CPAR1_PA,	0xFFFFFFFF	@ Peripheral Address

@ Bit definition for DMA_CPAR2 register
.equ	DMA_CPAR2_PA,	0xFFFFFFFF	@ Peripheral Address

@ Bit definition for DMA_CPAR3 register
.equ	DMA_CPAR3_PA,	0xFFFFFFFF	@ Peripheral Address


@ Bit definition for DMA_CPAR4 register
.equ	DMA_CPAR4_PA,	0xFFFFFFFF	@ Peripheral Address

@ Bit definition for DMA_CPAR5 register
.equ	DMA_CPAR5_PA,	0xFFFFFFFF	@ Peripheral Address

@ Bit definition for DMA_CPAR6 register
.equ	DMA_CPAR6_PA,	0xFFFFFFFF	@ Peripheral Address


@ Bit definition for DMA_CPAR7 register
.equ	DMA_CPAR7_PA,	0xFFFFFFFF	@ Peripheral Address

@ Bit definition for DMA_CMAR1 register
.equ	DMA_CMAR1_MA,	0xFFFFFFFF	@ Memory Address

@ Bit definition for DMA_CMAR2 register
.equ	DMA_CMAR2_MA,	0xFFFFFFFF	@ Memory Address

@ Bit definition for DMA_CMAR3 register
.equ	DMA_CMAR3_MA,	0xFFFFFFFF	@ Memory Address


@ Bit definition for DMA_CMAR4 register
.equ	DMA_CMAR4_MA,	0xFFFFFFFF	@ Memory Address

@ Bit definition for DMA_CMAR5 register
.equ	DMA_CMAR5_MA,	0xFFFFFFFF	@ Memory Address

@ Bit definition for DMA_CMAR6 register
.equ	DMA_CMAR6_MA,	0xFFFFFFFF	@ Memory Address

@ Bit definition for DMA_CMAR7 register
.equ	DMA_CMAR7_MA,	0xFFFFFFFF	@ Memory Address


@
@ Analog to Digital Converter
@


@ Bit definition for ADC_SR register
.equ	ADC_SR_AWD,	0x01	@ Analog watchdog flag
.equ	ADC_SR_EOC,	0x02	@ End of conversion
.equ	ADC_SR_JEOC,	0x04	@ Injected channel end of conversion
.equ	ADC_SR_JSTRT,	0x08	@ Injected channel Start flag
.equ	ADC_SR_STRT,	0x10	@ Regular channel Start flag

@ Bit definition for ADC_CR1 register
.equ	ADC_CR1_AWDCH,	0x0000001F	@ AWDCH[4:0] bits (Analog watchdog channel select bits)
.equ	ADC_CR1_AWDCH_0,	0x00000001	@ Bit 0
.equ	ADC_CR1_AWDCH_1,	0x00000002	@ Bit 1
.equ	ADC_CR1_AWDCH_2,	0x00000004	@ Bit 2
.equ	ADC_CR1_AWDCH_3,	0x00000008	@ Bit 3
.equ	ADC_CR1_AWDCH_4,	0x00000010	@ Bit 4

.equ	ADC_CR1_EOCIE,	0x00000020	@ Interrupt enable for EOC
.equ	ADC_CR1_AWDIE,	0x00000040	@ AAnalog Watchdog interrupt enable
.equ	ADC_CR1_JEOCIE,	0x00000080	@ Interrupt enable for injected channels
.equ	ADC_CR1_SCAN,	0x00000100	@ Scan mode
.equ	ADC_CR1_AWDSGL,	0x00000200	@ Enable the watchdog on a single channel in scan mode
.equ	ADC_CR1_JAUTO,	0x00000400	@ Automatic injected group conversion
.equ	ADC_CR1_DISCEN,	0x00000800	@ Discontinuous mode on regular channels
.equ	ADC_CR1_JDISCEN,	0x00001000	@ Discontinuous mode on injected channels

.equ	ADC_CR1_DISCNUM,	0x0000E000	@ DISCNUM[2:0] bits (Discontinuous mode channel count)
.equ	ADC_CR1_DISCNUM_0,	0x00002000	@ Bit 0
.equ	ADC_CR1_DISCNUM_1,	0x00004000	@ Bit 1
.equ	ADC_CR1_DISCNUM_2,	0x00008000	@ Bit 2

.equ	ADC_CR1_DUALMOD,	0x000F0000	@ DUALMOD[3:0] bits (Dual mode selection)
.equ	ADC_CR1_DUALMOD_0,	0x00010000	@ Bit 0
.equ	ADC_CR1_DUALMOD_1,	0x00020000	@ Bit 1
.equ	ADC_CR1_DUALMOD_2,	0x00040000	@ Bit 2
.equ	ADC_CR1_DUALMOD_3,	0x00080000	@ Bit 3

.equ	ADC_CR1_JAWDEN,	0x00400000	@ Analog watchdog enable on injected channels
.equ	ADC_CR1_AWDEN,	0x00800000	@ Analog watchdog enable on regular channels


@ Bit definition for ADC_CR2 register
.equ	ADC_CR2_ADON,	0x00000001	@ A/D Converter ON / OFF
.equ	ADC_CR2_CONT,	0x00000002	@ Continuous Conversion
.equ	ADC_CR2_CAL,	0x00000004	@ A/D Calibration
.equ	ADC_CR2_RSTCAL,	0x00000008	@ Reset Calibration
.equ	ADC_CR2_DMA,	0x00000100	@ Direct Memory access mode
.equ	ADC_CR2_ALIGN,	0x00000800	@ Data Alignment

.equ	ADC_CR2_JEXTSEL,	0x00007000	@ JEXTSEL[2:0] bits (External event select for injected group)
.equ	ADC_CR2_JEXTSEL_0,	0x00001000	@ Bit 0
.equ	ADC_CR2_JEXTSEL_1,	0x00002000	@ Bit 1
.equ	ADC_CR2_JEXTSEL_2,	0x00004000	@ Bit 2

.equ	ADC_CR2_JEXTTRIG,	0x00008000	@ External Trigger Conversion mode for injected channels

.equ	ADC_CR2_EXTSEL,	0x000E0000	@ EXTSEL[2:0] bits (External Event Select for regular group)
.equ	ADC_CR2_EXTSEL_0,	0x00020000	@ Bit 0
.equ	ADC_CR2_EXTSEL_1,	0x00040000	@ Bit 1
.equ	ADC_CR2_EXTSEL_2,	0x00080000	@ Bit 2

.equ	ADC_CR2_EXTTRIG,	0x00100000	@ External Trigger Conversion mode for regular channels
.equ	ADC_CR2_JSWSTART,	0x00200000	@ Start Conversion of injected channels
.equ	ADC_CR2_SWSTART,	0x00400000	@ Start Conversion of regular channels
.equ	ADC_CR2_TSVREFE,	0x00800000	@ Temperature Sensor and VREFINT Enable

@ Bit definition for ADC_SMPR1 register
.equ	ADC_SMPR1_SMP10,	0x00000007	@ SMP10[2:0] bits (Channel 10 Sample time selection)
.equ	ADC_SMPR1_SMP10_0,	0x00000001	@ Bit 0
.equ	ADC_SMPR1_SMP10_1,	0x00000002	@ Bit 1
.equ	ADC_SMPR1_SMP10_2,	0x00000004	@ Bit 2

.equ	ADC_SMPR1_SMP11,	0x00000038	@ SMP11[2:0] bits (Channel 11 Sample time selection)
.equ	ADC_SMPR1_SMP11_0,	0x00000008	@ Bit 0
.equ	ADC_SMPR1_SMP11_1,	0x00000010	@ Bit 1
.equ	ADC_SMPR1_SMP11_2,	0x00000020	@ Bit 2

.equ	ADC_SMPR1_SMP12,	0x000001C0	@ SMP12[2:0] bits (Channel 12 Sample time selection)
.equ	ADC_SMPR1_SMP12_0,	0x00000040	@ Bit 0
.equ	ADC_SMPR1_SMP12_1,	0x00000080	@ Bit 1
.equ	ADC_SMPR1_SMP12_2,	0x00000100	@ Bit 2

.equ	ADC_SMPR1_SMP13,	0x00000E00	@ SMP13[2:0] bits (Channel 13 Sample time selection)
.equ	ADC_SMPR1_SMP13_0,	0x00000200	@ Bit 0
.equ	ADC_SMPR1_SMP13_1,	0x00000400	@ Bit 1
.equ	ADC_SMPR1_SMP13_2,	0x00000800	@ Bit 2

.equ	ADC_SMPR1_SMP14,	0x00007000	@ SMP14[2:0] bits (Channel 14 Sample time selection)
.equ	ADC_SMPR1_SMP14_0,	0x00001000	@ Bit 0
.equ	ADC_SMPR1_SMP14_1,	0x00002000	@ Bit 1
.equ	ADC_SMPR1_SMP14_2,	0x00004000	@ Bit 2

.equ	ADC_SMPR1_SMP15,	0x00038000	@ SMP15[2:0] bits (Channel 15 Sample time selection)
.equ	ADC_SMPR1_SMP15_0,	0x00008000	@ Bit 0
.equ	ADC_SMPR1_SMP15_1,	0x00010000	@ Bit 1
.equ	ADC_SMPR1_SMP15_2,	0x00020000	@ Bit 2

.equ	ADC_SMPR1_SMP16,	0x001C0000	@ SMP16[2:0] bits (Channel 16 Sample time selection)
.equ	ADC_SMPR1_SMP16_0,	0x00040000	@ Bit 0
.equ	ADC_SMPR1_SMP16_1,	0x00080000	@ Bit 1
.equ	ADC_SMPR1_SMP16_2,	0x00100000	@ Bit 2

.equ	ADC_SMPR1_SMP17,	0x00E00000	@ SMP17[2:0] bits (Channel 17 Sample time selection)
.equ	ADC_SMPR1_SMP17_0,	0x00200000	@ Bit 0
.equ	ADC_SMPR1_SMP17_1,	0x00400000	@ Bit 1
.equ	ADC_SMPR1_SMP17_2,	0x00800000	@ Bit 2

@ Bit definition for ADC_SMPR2 register
.equ	ADC_SMPR2_SMP0,	0x00000007	@ SMP0[2:0] bits (Channel 0 Sample time selection)
.equ	ADC_SMPR2_SMP0_0,	0x00000001	@ Bit 0
.equ	ADC_SMPR2_SMP0_1,	0x00000002	@ Bit 1
.equ	ADC_SMPR2_SMP0_2,	0x00000004	@ Bit 2

.equ	ADC_SMPR2_SMP1,	0x00000038	@ SMP1[2:0] bits (Channel 1 Sample time selection)
.equ	ADC_SMPR2_SMP1_0,	0x00000008	@ Bit 0
.equ	ADC_SMPR2_SMP1_1,	0x00000010	@ Bit 1
.equ	ADC_SMPR2_SMP1_2,	0x00000020	@ Bit 2

