Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
.equ	TIM_CCMR2_OC4M,	0x7000	@ OC4M[2:0] bits (Output Compare 4 Mode)
.equ	TIM_CCMR2_OC4M_0,	0x1000	@ Bit 0
.equ	TIM_CCMR2_OC4M_1,	0x2000	@ Bit 1
.equ	TIM_CCMR2_OC4M_2,	0x4000	@ Bit 2

.equ	TIM_CCMR2_OC4CE,	0x8000	@ Output Compare 4 Clear Enable

@----------------------------------------------------------------------------

.equ	TIM_CCMR2_IC3PSC,	0x000C	@ IC3PSC[1:0] bits (Input Capture 3 Prescaler)
.equ	TIM_CCMR2_IC3PSC_0,	0x0004	@ Bit 0
.equ	TIM_CCMR2_IC3PSC_1,	0x0008	@ Bit 1

.equ	TIM_CCMR2_IC3F,	0x00F0	@ IC3F[3:0] bits (Input Capture 3 Filter)
.equ	TIM_CCMR2_IC3F_0,	0x0010	@ Bit 0
.equ	TIM_CCMR2_IC3F_1,	0x0020	@ Bit 1
.equ	TIM_CCMR2_IC3F_2,	0x0040	@ Bit 2
.equ	TIM_CCMR2_IC3F_3,	0x0080	@ Bit 3

.equ	TIM_CCMR2_IC4PSC,	0x0C00	@ IC4PSC[1:0] bits (Input Capture 4 Prescaler)
.equ	TIM_CCMR2_IC4PSC_0,	0x0400	@ Bit 0
.equ	TIM_CCMR2_IC4PSC_1,	0x0800	@ Bit 1

.equ	TIM_CCMR2_IC4F,	0xF000	@ IC4F[3:0] bits (Input Capture 4 Filter)
.equ	TIM_CCMR2_IC4F_0,	0x1000	@ Bit 0
.equ	TIM_CCMR2_IC4F_1,	0x2000	@ Bit 1
.equ	TIM_CCMR2_IC4F_2,	0x4000	@ Bit 2
.equ	TIM_CCMR2_IC4F_3,	0x8000	@ Bit 3

@ Bit definition for TIM_CCER register
.equ	TIM_CCER_CC1E,	0x0001	@ Capture/Compare 1 output enable
.equ	TIM_CCER_CC1P,	0x0002	@ Capture/Compare 1 output Polarity
.equ	TIM_CCER_CC1NE,	0x0004	@ Capture/Compare 1 Complementary output enable
.equ	TIM_CCER_CC1NP,	0x0008	@ Capture/Compare 1 Complementary output Polarity
.equ	TIM_CCER_CC2E,	0x0010	@ Capture/Compare 2 output enable
.equ	TIM_CCER_CC2P,	0x0020	@ Capture/Compare 2 output Polarity
.equ	TIM_CCER_CC2NE,	0x0040	@ Capture/Compare 2 Complementary output enable
.equ	TIM_CCER_CC2NP,	0x0080	@ Capture/Compare 2 Complementary output Polarity
.equ	TIM_CCER_CC3E,	0x0100	@ Capture/Compare 3 output enable
.equ	TIM_CCER_CC3P,	0x0200	@ Capture/Compare 3 output Polarity
.equ	TIM_CCER_CC3NE,	0x0400	@ Capture/Compare 3 Complementary output enable
.equ	TIM_CCER_CC3NP,	0x0800	@ Capture/Compare 3 Complementary output Polarity
.equ	TIM_CCER_CC4E,	0x1000	@ Capture/Compare 4 output enable
.equ	TIM_CCER_CC4P,	0x2000	@ Capture/Compare 4 output Polarity

@ Bit definition for TIM_CNT register
.equ	TIM_CNT_CNT,	0xFFFF	@ Counter Value

@ Bit definition for TIM_PSC register
.equ	TIM_PSC_PSC,	0xFFFF	@ Prescaler Value

@ Bit definition for TIM_ARR register
.equ	TIM_ARR_ARR,	0xFFFF	@ actual auto-reload Value

@ Bit definition for TIM_RCR register
.equ	TIM_RCR_REP,	0xFF	@ Repetition Counter Value

@ Bit definition for TIM_CCR1 register
.equ	TIM_CCR1_CCR1,	0xFFFF	@ Capture/Compare 1 Value

@ Bit definition for TIM_CCR2 register
.equ	TIM_CCR2_CCR2,	0xFFFF	@ Capture/Compare 2 Value

@ Bit definition for TIM_CCR3 register
.equ	TIM_CCR3_CCR3,	0xFFFF	@ Capture/Compare 3 Value

@ Bit definition for TIM_CCR4 register
.equ	TIM_CCR4_CCR4,	0xFFFF	@ Capture/Compare 4 Value

@ Bit definition for TIM_BDTR register
.equ	TIM_BDTR_DTG,	0x00FF	@ DTG[0:7] bits (Dead-Time Generator set-up)
.equ	TIM_BDTR_DTG_0,	0x0001	@ Bit 0
.equ	TIM_BDTR_DTG_1,	0x0002	@ Bit 1
.equ	TIM_BDTR_DTG_2,	0x0004	@ Bit 2
.equ	TIM_BDTR_DTG_3,	0x0008	@ Bit 3
.equ	TIM_BDTR_DTG_4,	0x0010	@ Bit 4
.equ	TIM_BDTR_DTG_5,	0x0020	@ Bit 5
.equ	TIM_BDTR_DTG_6,	0x0040	@ Bit 6
.equ	TIM_BDTR_DTG_7,	0x0080	@ Bit 7

.equ	TIM_BDTR_LOCK,	0x0300	@ LOCK[1:0] bits (Lock Configuration)
.equ	TIM_BDTR_LOCK_0,	0x0100	@ Bit 0
.equ	TIM_BDTR_LOCK_1,	0x0200	@ Bit 1

.equ	TIM_BDTR_OSSI,	0x0400	@ Off-State Selection for Idle mode
.equ	TIM_BDTR_OSSR,	0x0800	@ Off-State Selection for Run mode
.equ	TIM_BDTR_BKE,	0x1000	@ Break enable
.equ	TIM_BDTR_BKP,	0x2000	@ Break Polarity
.equ	TIM_BDTR_AOE,	0x4000	@ Automatic Output enable
.equ	TIM_BDTR_MOE,	0x8000	@ Main Output enable

@ Bit definition for TIM_DCR register
.equ	TIM_DCR_DBA,	0x001F	@ DBA[4:0] bits (DMA Base Address)
.equ	TIM_DCR_DBA_0,	0x0001	@ Bit 0
.equ	TIM_DCR_DBA_1,	0x0002	@ Bit 1
.equ	TIM_DCR_DBA_2,	0x0004	@ Bit 2
.equ	TIM_DCR_DBA_3,	0x0008	@ Bit 3
.equ	TIM_DCR_DBA_4,	0x0010	@ Bit 4

.equ	TIM_DCR_DBL,	0x1F00	@ DBL[4:0] bits (DMA Burst Length)
.equ	TIM_DCR_DBL_0,	0x0100	@ Bit 0
.equ	TIM_DCR_DBL_1,	0x0200	@ Bit 1
.equ	TIM_DCR_DBL_2,	0x0400	@ Bit 2
.equ	TIM_DCR_DBL_3,	0x0800	@ Bit 3
.equ	TIM_DCR_DBL_4,	0x1000	@ Bit 4

@ Bit definition for TIM_DMAR register
.equ	TIM_DMAR_DMAB,	0xFFFF	@ DMA register for burst accesses


@
@ Real-Time Clock
@


@ Bit definition for RTC_CRH register
.equ	RTC_CRH_SECIE,	0x01	@ Second Interrupt Enable
.equ	RTC_CRH_ALRIE,	0x02	@ Alarm Interrupt Enable
.equ	RTC_CRH_OWIE,	0x04	@ OverfloW Interrupt Enable

@ Bit definition for RTC_CRL register
.equ	RTC_CRL_SECF,	0x01	@ Second Flag
.equ	RTC_CRL_ALRF,	0x02	@ Alarm Flag
.equ	RTC_CRL_OWF,	0x04	@ OverfloW Flag
.equ	RTC_CRL_RSF,	0x08	@ Registers Synchronized Flag
.equ	RTC_CRL_CNF,	0x10	@ Configuration Flag
.equ	RTC_CRL_RTOFF,	0x20	@ RTC operation OFF

@ Bit definition for RTC_PRLH register
.equ	RTC_PRLH_PRL,	0x000F	@ RTC Prescaler Reload Value High

@ Bit definition for RTC_PRLL register
.equ	RTC_PRLL_PRL,	0xFFFF	@ RTC Prescaler Reload Value Low

@ Bit definition for RTC_DIVH register
.equ	RTC_DIVH_RTC_DIV,	0x000F	@ RTC Clock Divider High

@ Bit definition for RTC_DIVL register
.equ	RTC_DIVL_RTC_DIV,	0xFFFF	@ RTC Clock Divider Low

@ Bit definition for RTC_CNTH register
.equ	RTC_CNTH_RTC_CNT,	0xFFFF	@ RTC Counter High

@ Bit definition for RTC_CNTL register
.equ	RTC_CNTL_RTC_CNT,	0xFFFF	@ RTC Counter Low

@ Bit definition for RTC_ALRH register
.equ	RTC_ALRH_RTC_ALR,	0xFFFF	@ RTC Alarm High

@ Bit definition for RTC_ALRL register
.equ	RTC_ALRL_RTC_ALR,	0xFFFF	@ RTC Alarm Low


@
@ Independent WATCHDOG
@


@ Bit definition for IWDG_KR register
.equ	IWDG_KR_KEY,	0xFFFF	@ Key value (write only, read 0000h)

@ Bit definition for IWDG_PR register
.equ	IWDG_PR_PR,	0x07	@ PR[2:0] (Prescaler divider)
.equ	IWDG_PR_PR_0,	0x01	@ Bit 0
.equ	IWDG_PR_PR_1,	0x02	@ Bit 1
.equ	IWDG_PR_PR_2,	0x04	@ Bit 2

@ Bit definition for IWDG_RLR register
.equ	IWDG_RLR_RL,	0x0FFF	@ Watchdog counter reload value

@ Bit definition for IWDG_SR register
.equ	IWDG_SR_PVU,	0x01	@ Watchdog prescaler value update
.equ	IWDG_SR_RVU,	0x02	@ Watchdog counter reload value update


@
@ Window WATCHDOG
@


@ Bit definition for WWDG_CR register
.equ	WWDG_CR_T,	0x7F	@ T[6:0] bits (7-Bit counter (MSB to LSB))
.equ	WWDG_CR_T0,	0x01	@ Bit 0
.equ	WWDG_CR_T1,	0x02	@ Bit 1
.equ	WWDG_CR_T2,	0x04	@ Bit 2
.equ	WWDG_CR_T3,	0x08	@ Bit 3
.equ	WWDG_CR_T4,	0x10	@ Bit 4
.equ	WWDG_CR_T5,	0x20	@ Bit 5
.equ	WWDG_CR_T6,	0x40	@ Bit 6

.equ	WWDG_CR_WDGA,	0x80	@ Activation bit

