Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
.equ	FSMC_PMEM4_MEMHIZ4,	0xFF000000	@ MEMHIZ4[7:0] bits (Common memory 4 databus HiZ time)
.equ	FSMC_PMEM4_MEMHIZ4_0,	0x01000000	@ Bit 0
.equ	FSMC_PMEM4_MEMHIZ4_1,	0x02000000	@ Bit 1
.equ	FSMC_PMEM4_MEMHIZ4_2,	0x04000000	@ Bit 2
.equ	FSMC_PMEM4_MEMHIZ4_3,	0x08000000	@ Bit 3
.equ	FSMC_PMEM4_MEMHIZ4_4,	0x10000000	@ Bit 4
.equ	FSMC_PMEM4_MEMHIZ4_5,	0x20000000	@ Bit 5
.equ	FSMC_PMEM4_MEMHIZ4_6,	0x40000000	@ Bit 6
.equ	FSMC_PMEM4_MEMHIZ4_7,	0x80000000	@ Bit 7

@ Bit definition for FSMC_PATT2 register
.equ	FSMC_PATT2_ATTSET2,	0x000000FF	@ ATTSET2[7:0] bits (Attribute memory 2 setup time)
.equ	FSMC_PATT2_ATTSET2_0,	0x00000001	@ Bit 0
.equ	FSMC_PATT2_ATTSET2_1,	0x00000002	@ Bit 1
.equ	FSMC_PATT2_ATTSET2_2,	0x00000004	@ Bit 2
.equ	FSMC_PATT2_ATTSET2_3,	0x00000008	@ Bit 3
.equ	FSMC_PATT2_ATTSET2_4,	0x00000010	@ Bit 4
.equ	FSMC_PATT2_ATTSET2_5,	0x00000020	@ Bit 5
.equ	FSMC_PATT2_ATTSET2_6,	0x00000040	@ Bit 6
.equ	FSMC_PATT2_ATTSET2_7,	0x00000080	@ Bit 7

.equ	FSMC_PATT2_ATTWAIT2,	0x0000FF00	@ ATTWAIT2[7:0] bits (Attribute memory 2 wait time)
.equ	FSMC_PATT2_ATTWAIT2_0,	0x00000100	@ Bit 0
.equ	FSMC_PATT2_ATTWAIT2_1,	0x00000200	@ Bit 1
.equ	FSMC_PATT2_ATTWAIT2_2,	0x00000400	@ Bit 2
.equ	FSMC_PATT2_ATTWAIT2_3,	0x00000800	@ Bit 3
.equ	FSMC_PATT2_ATTWAIT2_4,	0x00001000	@ Bit 4
.equ	FSMC_PATT2_ATTWAIT2_5,	0x00002000	@ Bit 5
.equ	FSMC_PATT2_ATTWAIT2_6,	0x00004000	@ Bit 6
.equ	FSMC_PATT2_ATTWAIT2_7,	0x00008000	@ Bit 7

.equ	FSMC_PATT2_ATTHOLD2,	0x00FF0000	@ ATTHOLD2[7:0] bits (Attribute memory 2 hold time)
.equ	FSMC_PATT2_ATTHOLD2_0,	0x00010000	@ Bit 0
.equ	FSMC_PATT2_ATTHOLD2_1,	0x00020000	@ Bit 1
.equ	FSMC_PATT2_ATTHOLD2_2,	0x00040000	@ Bit 2
.equ	FSMC_PATT2_ATTHOLD2_3,	0x00080000	@ Bit 3
.equ	FSMC_PATT2_ATTHOLD2_4,	0x00100000	@ Bit 4
.equ	FSMC_PATT2_ATTHOLD2_5,	0x00200000	@ Bit 5
.equ	FSMC_PATT2_ATTHOLD2_6,	0x00400000	@ Bit 6
.equ	FSMC_PATT2_ATTHOLD2_7,	0x00800000	@ Bit 7

.equ	FSMC_PATT2_ATTHIZ2,	0xFF000000	@ ATTHIZ2[7:0] bits (Attribute memory 2 databus HiZ time)
.equ	FSMC_PATT2_ATTHIZ2_0,	0x01000000	@ Bit 0
.equ	FSMC_PATT2_ATTHIZ2_1,	0x02000000	@ Bit 1
.equ	FSMC_PATT2_ATTHIZ2_2,	0x04000000	@ Bit 2
.equ	FSMC_PATT2_ATTHIZ2_3,	0x08000000	@ Bit 3
.equ	FSMC_PATT2_ATTHIZ2_4,	0x10000000	@ Bit 4
.equ	FSMC_PATT2_ATTHIZ2_5,	0x20000000	@ Bit 5
.equ	FSMC_PATT2_ATTHIZ2_6,	0x40000000	@ Bit 6
.equ	FSMC_PATT2_ATTHIZ2_7,	0x80000000	@ Bit 7

@ Bit definition for FSMC_PATT3 register
.equ	FSMC_PATT3_ATTSET3,	0x000000FF	@ ATTSET3[7:0] bits (Attribute memory 3 setup time)
.equ	FSMC_PATT3_ATTSET3_0,	0x00000001	@ Bit 0
.equ	FSMC_PATT3_ATTSET3_1,	0x00000002	@ Bit 1
.equ	FSMC_PATT3_ATTSET3_2,	0x00000004	@ Bit 2
.equ	FSMC_PATT3_ATTSET3_3,	0x00000008	@ Bit 3
.equ	FSMC_PATT3_ATTSET3_4,	0x00000010	@ Bit 4
.equ	FSMC_PATT3_ATTSET3_5,	0x00000020	@ Bit 5
.equ	FSMC_PATT3_ATTSET3_6,	0x00000040	@ Bit 6
.equ	FSMC_PATT3_ATTSET3_7,	0x00000080	@ Bit 7

.equ	FSMC_PATT3_ATTWAIT3,	0x0000FF00	@ ATTWAIT3[7:0] bits (Attribute memory 3 wait time)
.equ	FSMC_PATT3_ATTWAIT3_0,	0x00000100	@ Bit 0
.equ	FSMC_PATT3_ATTWAIT3_1,	0x00000200	@ Bit 1
.equ	FSMC_PATT3_ATTWAIT3_2,	0x00000400	@ Bit 2
.equ	FSMC_PATT3_ATTWAIT3_3,	0x00000800	@ Bit 3
.equ	FSMC_PATT3_ATTWAIT3_4,	0x00001000	@ Bit 4
.equ	FSMC_PATT3_ATTWAIT3_5,	0x00002000	@ Bit 5
.equ	FSMC_PATT3_ATTWAIT3_6,	0x00004000	@ Bit 6
.equ	FSMC_PATT3_ATTWAIT3_7,	0x00008000	@ Bit 7

.equ	FSMC_PATT3_ATTHOLD3,	0x00FF0000	@ ATTHOLD3[7:0] bits (Attribute memory 3 hold time)
.equ	FSMC_PATT3_ATTHOLD3_0,	0x00010000	@ Bit 0
.equ	FSMC_PATT3_ATTHOLD3_1,	0x00020000	@ Bit 1
.equ	FSMC_PATT3_ATTHOLD3_2,	0x00040000	@ Bit 2
.equ	FSMC_PATT3_ATTHOLD3_3,	0x00080000	@ Bit 3
.equ	FSMC_PATT3_ATTHOLD3_4,	0x00100000	@ Bit 4
.equ	FSMC_PATT3_ATTHOLD3_5,	0x00200000	@ Bit 5
.equ	FSMC_PATT3_ATTHOLD3_6,	0x00400000	@ Bit 6
.equ	FSMC_PATT3_ATTHOLD3_7,	0x00800000	@ Bit 7

.equ	FSMC_PATT3_ATTHIZ3,	0xFF000000	@ ATTHIZ3[7:0] bits (Attribute memory 3 databus HiZ time)
.equ	FSMC_PATT3_ATTHIZ3_0,	0x01000000	@ Bit 0
.equ	FSMC_PATT3_ATTHIZ3_1,	0x02000000	@ Bit 1
.equ	FSMC_PATT3_ATTHIZ3_2,	0x04000000	@ Bit 2
.equ	FSMC_PATT3_ATTHIZ3_3,	0x08000000	@ Bit 3
.equ	FSMC_PATT3_ATTHIZ3_4,	0x10000000	@ Bit 4
.equ	FSMC_PATT3_ATTHIZ3_5,	0x20000000	@ Bit 5
.equ	FSMC_PATT3_ATTHIZ3_6,	0x40000000	@ Bit 6
.equ	FSMC_PATT3_ATTHIZ3_7,	0x80000000	@ Bit 7

@ Bit definition for FSMC_PATT4 register
.equ	FSMC_PATT4_ATTSET4,	0x000000FF	@ ATTSET4[7:0] bits (Attribute memory 4 setup time)
.equ	FSMC_PATT4_ATTSET4_0,	0x00000001	@ Bit 0
.equ	FSMC_PATT4_ATTSET4_1,	0x00000002	@ Bit 1
.equ	FSMC_PATT4_ATTSET4_2,	0x00000004	@ Bit 2
.equ	FSMC_PATT4_ATTSET4_3,	0x00000008	@ Bit 3
.equ	FSMC_PATT4_ATTSET4_4,	0x00000010	@ Bit 4
.equ	FSMC_PATT4_ATTSET4_5,	0x00000020	@ Bit 5
.equ	FSMC_PATT4_ATTSET4_6,	0x00000040	@ Bit 6
.equ	FSMC_PATT4_ATTSET4_7,	0x00000080	@ Bit 7

.equ	FSMC_PATT4_ATTWAIT4,	0x0000FF00	@ ATTWAIT4[7:0] bits (Attribute memory 4 wait time)
.equ	FSMC_PATT4_ATTWAIT4_0,	0x00000100	@ Bit 0
.equ	FSMC_PATT4_ATTWAIT4_1,	0x00000200	@ Bit 1
.equ	FSMC_PATT4_ATTWAIT4_2,	0x00000400	@ Bit 2
.equ	FSMC_PATT4_ATTWAIT4_3,	0x00000800	@ Bit 3
.equ	FSMC_PATT4_ATTWAIT4_4,	0x00001000	@ Bit 4
.equ	FSMC_PATT4_ATTWAIT4_5,	0x00002000	@ Bit 5
.equ	FSMC_PATT4_ATTWAIT4_6,	0x00004000	@ Bit 6
.equ	FSMC_PATT4_ATTWAIT4_7,	0x00008000	@ Bit 7

.equ	FSMC_PATT4_ATTHOLD4,	0x00FF0000	@ ATTHOLD4[7:0] bits (Attribute memory 4 hold time)
.equ	FSMC_PATT4_ATTHOLD4_0,	0x00010000	@ Bit 0
.equ	FSMC_PATT4_ATTHOLD4_1,	0x00020000	@ Bit 1
.equ	FSMC_PATT4_ATTHOLD4_2,	0x00040000	@ Bit 2
.equ	FSMC_PATT4_ATTHOLD4_3,	0x00080000	@ Bit 3
.equ	FSMC_PATT4_ATTHOLD4_4,	0x00100000	@ Bit 4
.equ	FSMC_PATT4_ATTHOLD4_5,	0x00200000	@ Bit 5
.equ	FSMC_PATT4_ATTHOLD4_6,	0x00400000	@ Bit 6
.equ	FSMC_PATT4_ATTHOLD4_7,	0x00800000	@ Bit 7

.equ	FSMC_PATT4_ATTHIZ4,	0xFF000000	@ ATTHIZ4[7:0] bits (Attribute memory 4 databus HiZ time)
.equ	FSMC_PATT4_ATTHIZ4_0,	0x01000000	@ Bit 0
.equ	FSMC_PATT4_ATTHIZ4_1,	0x02000000	@ Bit 1
.equ	FSMC_PATT4_ATTHIZ4_2,	0x04000000	@ Bit 2
.equ	FSMC_PATT4_ATTHIZ4_3,	0x08000000	@ Bit 3
.equ	FSMC_PATT4_ATTHIZ4_4,	0x10000000	@ Bit 4
.equ	FSMC_PATT4_ATTHIZ4_5,	0x20000000	@ Bit 5
.equ	FSMC_PATT4_ATTHIZ4_6,	0x40000000	@ Bit 6
.equ	FSMC_PATT4_ATTHIZ4_7,	0x80000000	@ Bit 7

