Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
@ Endpoint-specific registers
@ Bit definition for USB_EP0R register
.equ	USB_EP0R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP0R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP0R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP0R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP0R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP0R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP0R_EP_KIND,	0x0100	@ Endpoint Kind

.equ	USB_EP0R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP0R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP0R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP0R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP0R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP0R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP0R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP0R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP0R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Bit definition for USB_EP1R register
.equ	USB_EP1R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP1R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP1R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP1R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP1R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP1R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP1R_EP_KIND,	0x0100	@ Endpoint Kind

.equ	USB_EP1R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP1R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP1R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP1R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP1R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP1R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP1R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP1R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP1R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Bit definition for USB_EP2R register
.equ	USB_EP2R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP2R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP2R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP2R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP2R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP2R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP2R_EP_KIND,	0x0100	@ Endpoint Kind

.equ	USB_EP2R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP2R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP2R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP2R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP2R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP2R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP2R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP2R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP2R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Bit definition for USB_EP3R register
.equ	USB_EP3R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP3R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP3R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP3R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP3R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP3R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP3R_EP_KIND,	0x0100	@ Endpoint Kind

.equ	USB_EP3R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP3R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP3R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP3R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP3R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP3R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP3R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP3R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP3R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Bit definition for USB_EP4R register
.equ	USB_EP4R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP4R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP4R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP4R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP4R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP4R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP4R_EP_KIND,	0x0100	@ Endpoint Kind

.equ	USB_EP4R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP4R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP4R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP4R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP4R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP4R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP4R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP4R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP4R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Bit definition for USB_EP5R register
.equ	USB_EP5R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP5R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP5R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP5R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP5R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP5R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP5R_EP_KIND,	0x0100	@ Endpoint Kind

.equ	USB_EP5R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP5R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP5R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP5R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP5R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP5R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP5R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP5R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP5R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Bit definition for USB_EP6R register
.equ	USB_EP6R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP6R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP6R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP6R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP6R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP6R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP6R_EP_KIND,	0x0100	@ Endpoint Kind

