Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
.equ	USB_EP6R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP6R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP6R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP6R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP6R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP6R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP6R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP6R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP6R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Bit definition for USB_EP7R register
.equ	USB_EP7R_EA,	0x000F	@ Endpoint Address

.equ	USB_EP7R_STAT_TX,	0x0030	@ STAT_TX[1:0] bits (Status bits, for transmission transfers)
.equ	USB_EP7R_STAT_TX_0,	0x0010	@ Bit 0
.equ	USB_EP7R_STAT_TX_1,	0x0020	@ Bit 1

.equ	USB_EP7R_DTOG_TX,	0x0040	@ Data Toggle, for transmission transfers
.equ	USB_EP7R_CTR_TX,	0x0080	@ Correct Transfer for transmission
.equ	USB_EP7R_EP_KIND,	0x0100	@ Endpoint Kind

.equ	USB_EP7R_EP_TYPE,	0x0600	@ EP_TYPE[1:0] bits (Endpoint type)
.equ	USB_EP7R_EP_TYPE_0,	0x0200	@ Bit 0
.equ	USB_EP7R_EP_TYPE_1,	0x0400	@ Bit 1

.equ	USB_EP7R_SETUP,	0x0800	@ Setup transaction completed

.equ	USB_EP7R_STAT_RX,	0x3000	@ STAT_RX[1:0] bits (Status bits, for reception transfers)
.equ	USB_EP7R_STAT_RX_0,	0x1000	@ Bit 0
.equ	USB_EP7R_STAT_RX_1,	0x2000	@ Bit 1

.equ	USB_EP7R_DTOG_RX,	0x4000	@ Data Toggle, for reception transfers
.equ	USB_EP7R_CTR_RX,	0x8000	@ Correct Transfer for reception

@ Common registers
@ Bit definition for USB_CNTR register
.equ	USB_CNTR_FRES,	0x0001	@ Force USB Reset
.equ	USB_CNTR_PDWN,	0x0002	@ Power down
.equ	USB_CNTR_LP_MODE,	0x0004	@ Low-power mode
.equ	USB_CNTR_FSUSP,	0x0008	@ Force suspend
.equ	USB_CNTR_RESUME,	0x0010	@ Resume request
.equ	USB_CNTR_ESOFM,	0x0100	@ Expected Start Of Frame Interrupt Mask
.equ	USB_CNTR_SOFM,	0x0200	@ Start Of Frame Interrupt Mask
.equ	USB_CNTR_RESETM,	0x0400	@ RESET Interrupt Mask
.equ	USB_CNTR_SUSPM,	0x0800	@ Suspend mode Interrupt Mask
.equ	USB_CNTR_WKUPM,	0x1000	@ Wakeup Interrupt Mask
.equ	USB_CNTR_ERRM,	0x2000	@ Error Interrupt Mask
.equ	USB_CNTR_PMAOVRM,	0x4000	@ Packet Memory Area Over / Underrun Interrupt Mask
.equ	USB_CNTR_CTRM,	0x8000	@ Correct Transfer Interrupt Mask

@ Bit definition for USB_ISTR register
.equ	USB_ISTR_EP_ID,	0x000F	@ Endpoint Identifier
.equ	USB_ISTR_DIR,	0x0010	@ Direction of transaction
.equ	USB_ISTR_ESOF,	0x0100	@ Expected Start Of Frame
.equ	USB_ISTR_SOF,	0x0200	@ Start Of Frame
.equ	USB_ISTR_RESET,	0x0400	@ USB RESET request
.equ	USB_ISTR_SUSP,	0x0800	@ Suspend mode request
.equ	USB_ISTR_WKUP,	0x1000	@ Wake up
.equ	USB_ISTR_ERR,	0x2000	@ Error
.equ	USB_ISTR_PMAOVR,	0x4000	@ Packet Memory Area Over / Underrun
.equ	USB_ISTR_CTR,	0x8000	@ Correct Transfer

@ Bit definition for USB_FNR register
.equ	USB_FNR_FN,	0x07FF	@ Frame Number
.equ	USB_FNR_LSOF,	0x1800	@ Lost SOF
.equ	USB_FNR_LCK,	0x2000	@ Locked
.equ	USB_FNR_RXDM,	0x4000	@ Receive Data - Line Status
.equ	USB_FNR_RXDP,	0x8000	@ Receive Data + Line Status

@ Bit definition for USB_DADDR register
.equ	USB_DADDR_ADD,	0x7F	@ ADD[6:0] bits (Device Address)
.equ	USB_DADDR_ADD0,	0x01	@ Bit 0
.equ	USB_DADDR_ADD1,	0x02	@ Bit 1
.equ	USB_DADDR_ADD2,	0x04	@ Bit 2
.equ	USB_DADDR_ADD3,	0x08	@ Bit 3
.equ	USB_DADDR_ADD4,	0x10	@ Bit 4
.equ	USB_DADDR_ADD5,	0x20	@ Bit 5
.equ	USB_DADDR_ADD6,	0x40	@ Bit 6

.equ	USB_DADDR_EF,	0x80	@ Enable Function

@ Bit definition for USB_BTABLE register
.equ	USB_BTABLE_BTABLE,	0xFFF8	@ Buffer Table

@ Buffer descriptor table
@ Bit definition for USB_ADDR0_TX register
.equ	USB_ADDR0_TX_ADDR0_TX,	0xFFFE	@ Transmission Buffer Address 0

@ Bit definition for USB_ADDR1_TX register
.equ	USB_ADDR1_TX_ADDR1_TX,	0xFFFE	@ Transmission Buffer Address 1

@ Bit definition for USB_ADDR2_TX register
.equ	USB_ADDR2_TX_ADDR2_TX,	0xFFFE	@ Transmission Buffer Address 2

@ Bit definition for USB_ADDR3_TX register
.equ	USB_ADDR3_TX_ADDR3_TX,	0xFFFE	@ Transmission Buffer Address 3

@ Bit definition for USB_ADDR4_TX register
.equ	USB_ADDR4_TX_ADDR4_TX,	0xFFFE	@ Transmission Buffer Address 4

@ Bit definition for USB_ADDR5_TX register
.equ	USB_ADDR5_TX_ADDR5_TX,	0xFFFE	@ Transmission Buffer Address 5

@ Bit definition for USB_ADDR6_TX register
.equ	USB_ADDR6_TX_ADDR6_TX,	0xFFFE	@ Transmission Buffer Address 6

@ Bit definition for USB_ADDR7_TX register
.equ	USB_ADDR7_TX_ADDR7_TX,	0xFFFE	@ Transmission Buffer Address 7

@----------------------------------------------------------------------------

@ Bit definition for USB_COUNT0_TX register
.equ	USB_COUNT0_TX_COUNT0_TX,	0x03FF	@ Transmission Byte Count 0

@ Bit definition for USB_COUNT1_TX register
.equ	USB_COUNT1_TX_COUNT1_TX,	0x03FF	@ Transmission Byte Count 1

@ Bit definition for USB_COUNT2_TX register
.equ	USB_COUNT2_TX_COUNT2_TX,	0x03FF	@ Transmission Byte Count 2

@ Bit definition for USB_COUNT3_TX register
.equ	USB_COUNT3_TX_COUNT3_TX,	0x03FF	@ Transmission Byte Count 3

@ Bit definition for USB_COUNT4_TX register
.equ	USB_COUNT4_TX_COUNT4_TX,	0x03FF	@ Transmission Byte Count 4

@ Bit definition for USB_COUNT5_TX register
.equ	USB_COUNT5_TX_COUNT5_TX,	0x03FF	@ Transmission Byte Count 5

@ Bit definition for USB_COUNT6_TX register
.equ	USB_COUNT6_TX_COUNT6_TX,	0x03FF	@ Transmission Byte Count 6

@ Bit definition for USB_COUNT7_TX register
.equ	USB_COUNT7_TX_COUNT7_TX,	0x03FF	@ Transmission Byte Count 7

@----------------------------------------------------------------------------

@ Bit definition for USB_COUNT0_TX_0 register
.equ	USB_COUNT0_TX_0_COUNT0_TX_0,	0x000003FF	@ Transmission Byte Count 0 (low)

@ Bit definition for USB_COUNT0_TX_1 register
.equ	USB_COUNT0_TX_1_COUNT0_TX_1,	0x03FF0000	@ Transmission Byte Count 0 (high)

@ Bit definition for USB_COUNT1_TX_0 register
.equ	USB_COUNT1_TX_0_COUNT1_TX_0,	0x000003FF	@ Transmission Byte Count 1 (low)

@ Bit definition for USB_COUNT1_TX_1 register
.equ	USB_COUNT1_TX_1_COUNT1_TX_1,	0x03FF0000	@ Transmission Byte Count 1 (high)

@ Bit definition for USB_COUNT2_TX_0 register
.equ	USB_COUNT2_TX_0_COUNT2_TX_0,	0x000003FF	@ Transmission Byte Count 2 (low)

@ Bit definition for USB_COUNT2_TX_1 register
.equ	USB_COUNT2_TX_1_COUNT2_TX_1,	0x03FF0000	@ Transmission Byte Count 2 (high)

@ Bit definition for USB_COUNT3_TX_0 register
.equ	USB_COUNT3_TX_0_COUNT3_TX_0,	0x000003FF	@ Transmission Byte Count 3 (low)

@ Bit definition for USB_COUNT3_TX_1 register
.equ	USB_COUNT3_TX_1_COUNT3_TX_1,	0x03FF0000	@ Transmission Byte Count 3 (high)

@ Bit definition for USB_COUNT4_TX_0 register
.equ	USB_COUNT4_TX_0_COUNT4_TX_0,	0x000003FF	@ Transmission Byte Count 4 (low)

@ Bit definition for USB_COUNT4_TX_1 register
.equ	USB_COUNT4_TX_1_COUNT4_TX_1,	0x03FF0000	@ Transmission Byte Count 4 (high)

@ Bit definition for USB_COUNT5_TX_0 register
.equ	USB_COUNT5_TX_0_COUNT5_TX_0,	0x000003FF	@ Transmission Byte Count 5 (low)

@ Bit definition for USB_COUNT5_TX_1 register
.equ	USB_COUNT5_TX_1_COUNT5_TX_1,	0x03FF0000	@ Transmission Byte Count 5 (high)

