Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
@ Bit definition for USART_BRR register
.equ	USART_BRR_DIV_Fraction,	0x000F	@ Fraction of USARTDIV
.equ	USART_BRR_DIV_Mantissa,	0xFFF0	@ Mantissa of USARTDIV

@ Bit definition for USART_CR1 register
.equ	USART_CR1_SBK,	0x0001	@ Send Break
.equ	USART_CR1_RWU,	0x0002	@ Receiver wakeup
.equ	USART_CR1_RE,	0x0004	@ Receiver Enable
.equ	USART_CR1_TE,	0x0008	@ Transmitter Enable
.equ	USART_CR1_IDLEIE,	0x0010	@ IDLE Interrupt Enable
.equ	USART_CR1_RXNEIE,	0x0020	@ RXNE Interrupt Enable
.equ	USART_CR1_TCIE,	0x0040	@ Transmission Complete Interrupt Enable
.equ	USART_CR1_TXEIE,	0x0080	@ PE Interrupt Enable
.equ	USART_CR1_PEIE,	0x0100	@ PE Interrupt Enable
.equ	USART_CR1_PS,	0x0200	@ Parity Selection
.equ	USART_CR1_PCE,	0x0400	@ Parity Control Enable
.equ	USART_CR1_WAKE,	0x0800	@ Wakeup method
.equ	USART_CR1_M,	0x1000	@ Word length
.equ	USART_CR1_UE,	0x2000	@ USART Enable

@ Bit definition for USART_CR2 register
.equ	USART_CR2_ADD,	0x000F	@ Address of the USART node
.equ	USART_CR2_LBDL,	0x0020	@ LIN Break Detection Length
.equ	USART_CR2_LBDIE,	0x0040	@ LIN Break Detection Interrupt Enable
.equ	USART_CR2_LBCL,	0x0100	@ Last Bit Clock pulse
.equ	USART_CR2_CPHA,	0x0200	@ Clock Phase
.equ	USART_CR2_CPOL,	0x0400	@ Clock Polarity
.equ	USART_CR2_CLKEN,	0x0800	@ Clock Enable

.equ	USART_CR2_STOP,	0x3000	@ STOP[1:0] bits (STOP bits)
.equ	USART_CR2_STOP_0,	0x1000	@ Bit 0
.equ	USART_CR2_STOP_1,	0x2000	@ Bit 1

.equ	USART_CR2_LINEN,	0x4000	@ LIN mode enable

@ Bit definition for USART_CR3 register
.equ	USART_CR3_EIE,	0x0001	@ Error Interrupt Enable
.equ	USART_CR3_IREN,	0x0002	@ IrDA mode Enable
.equ	USART_CR3_IRLP,	0x0004	@ IrDA Low-Power
.equ	USART_CR3_HDSEL,	0x0008	@ Half-Duplex Selection
.equ	USART_CR3_NACK,	0x0010	@ Smartcard NACK enable
.equ	USART_CR3_SCEN,	0x0020	@ Smartcard mode enable
.equ	USART_CR3_DMAR,	0x0040	@ DMA Enable Receiver
.equ	USART_CR3_DMAT,	0x0080	@ DMA Enable Transmitter
.equ	USART_CR3_RTSE,	0x0100	@ RTS Enable
.equ	USART_CR3_CTSE,	0x0200	@ CTS Enable
.equ	USART_CR3_CTSIE,	0x0400	@ CTS Interrupt Enable

@ Bit definition for USART_GTPR register
.equ	USART_GTPR_PSC,	0x00FF	@ PSC[7:0] bits (Prescaler value)
.equ	USART_GTPR_PSC_0,	0x0001	@ Bit 0
.equ	USART_GTPR_PSC_1,	0x0002	@ Bit 1
.equ	USART_GTPR_PSC_2,	0x0004	@ Bit 2
.equ	USART_GTPR_PSC_3,	0x0008	@ Bit 3
.equ	USART_GTPR_PSC_4,	0x0010	@ Bit 4
.equ	USART_GTPR_PSC_5,	0x0020	@ Bit 5
.equ	USART_GTPR_PSC_6,	0x0040	@ Bit 6
.equ	USART_GTPR_PSC_7,	0x0080	@ Bit 7

.equ	USART_GTPR_GT,	0xFF00	@ Guard time value


@
@ Debug MCU
@


@ Bit definition for DBGMCU_IDCODE register
.equ	DBGMCU_IDCODE_DEV_ID,	0x00000FFF	@ Device Identifier

.equ	DBGMCU_IDCODE_REV_ID,	0xFFFF0000	@ REV_ID[15:0] bits (Revision Identifier)
.equ	DBGMCU_IDCODE_REV_ID_0,	0x00010000	@ Bit 0
.equ	DBGMCU_IDCODE_REV_ID_1,	0x00020000	@ Bit 1
.equ	DBGMCU_IDCODE_REV_ID_2,	0x00040000	@ Bit 2
.equ	DBGMCU_IDCODE_REV_ID_3,	0x00080000	@ Bit 3
.equ	DBGMCU_IDCODE_REV_ID_4,	0x00100000	@ Bit 4
.equ	DBGMCU_IDCODE_REV_ID_5,	0x00200000	@ Bit 5
.equ	DBGMCU_IDCODE_REV_ID_6,	0x00400000	@ Bit 6
.equ	DBGMCU_IDCODE_REV_ID_7,	0x00800000	@ Bit 7
.equ	DBGMCU_IDCODE_REV_ID_8,	0x01000000	@ Bit 8
.equ	DBGMCU_IDCODE_REV_ID_9,	0x02000000	@ Bit 9
.equ	DBGMCU_IDCODE_REV_ID_10,	0x04000000	@ Bit 10
.equ	DBGMCU_IDCODE_REV_ID_11,	0x08000000	@ Bit 11
.equ	DBGMCU_IDCODE_REV_ID_12,	0x10000000	@ Bit 12
.equ	DBGMCU_IDCODE_REV_ID_13,	0x20000000	@ Bit 13
.equ	DBGMCU_IDCODE_REV_ID_14,	0x40000000	@ Bit 14
.equ	DBGMCU_IDCODE_REV_ID_15,	0x80000000	@ Bit 15

@ Bit definition for DBGMCU_CR register
.equ	DBGMCU_CR_DBG_SLEEP,	0x00000001	@ Debug Sleep Mode
.equ	DBGMCU_CR_DBG_STOP,	0x00000002	@ Debug Stop Mode
.equ	DBGMCU_CR_DBG_STANDBY,	0x00000004	@ Debug Standby mode
.equ	DBGMCU_CR_TRACE_IOEN,	0x00000020	@ Trace Pin Assignment Control

.equ	DBGMCU_CR_TRACE_MODE,	0x000000C0	@ TRACE_MODE[1:0] bits (Trace Pin Assignment Control)
.equ	DBGMCU_CR_TRACE_MODE_0,	0x00000040	@ Bit 0
.equ	DBGMCU_CR_TRACE_MODE_1,	0x00000080	@ Bit 1

.equ	DBGMCU_CR_DBG_IWDG_STOP,	0x00000100	@ Debug Independent Watchdog stopped when Core is halted
.equ	DBGMCU_CR_DBG_WWDG_STOP,	0x00000200	@ Debug Window Watchdog stopped when Core is halted
.equ	DBGMCU_CR_DBG_TIM1_STOP,	0x00000400	@ TIM1 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_TIM2_STOP,	0x00000800	@ TIM2 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_TIM3_STOP,	0x00001000	@ TIM3 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_TIM4_STOP,	0x00002000	@ TIM4 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_CAN1_STOP,	0x00004000	@ Debug CAN1 stopped when Core is halted
.equ	DBGMCU_CR_DBG_I2C1_SMBUS_TIMEOUT,	0x00008000	@ SMBUS timeout mode stopped when Core is halted
.equ	DBGMCU_CR_DBG_I2C2_SMBUS_TIMEOUT,	0x00010000	@ SMBUS timeout mode stopped when Core is halted
.equ	DBGMCU_CR_DBG_TIM8_STOP,	0x00020000	@ TIM8 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_TIM5_STOP,	0x00040000	@ TIM5 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_TIM6_STOP,	0x00080000	@ TIM6 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_TIM7_STOP,	0x00100000	@ TIM7 counter stopped when core is halted
.equ	DBGMCU_CR_DBG_CAN2_STOP,	0x00200000	@ Debug CAN2 stopped when Core is halted


@
@ FLASH and Option Bytes Registers
@


@ Bit definition for FLASH_ACR register
.equ	FLASH_ACR_LATENCY,	0x03	@ LATENCY[2:0] bits (Latency)
.equ	FLASH_ACR_LATENCY_0,	0x00	@ Bit 0
.equ	FLASH_ACR_LATENCY_1,	0x01	@ Bit 0
.equ	FLASH_ACR_LATENCY_2,	0x02	@ Bit 1

.equ	FLASH_ACR_HLFCYA,	0x08	@ Flash Half Cycle Access Enable
.equ	FLASH_ACR_PRFTBE,	0x10	@ Prefetch Buffer Enable
.equ	FLASH_ACR_PRFTBS,	0x20	@ Prefetch Buffer Status

@ Bit definition for FLASH_KEYR register
.equ	FLASH_KEYR_FKEYR,	0xFFFFFFFF	@ FPEC Key

@ Bit definition for FLASH_OPTKEYR register
.equ	FLASH_OPTKEYR_OPTKEYR,	0xFFFFFFFF	@ Option Byte Key

@ Bit definition for FLASH_SR register
.equ	FLASH_SR_BSY,	0x01	@ Busy
.equ	FLASH_SR_PGERR,	0x04	@ Programming Error
.equ	FLASH_SR_WRPRTERR,	0x10	@ Write Protection Error
.equ	FLASH_SR_EOP,	0x20	@ End of operation

