Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
@ Bit definition for FLASH_CR register
.equ	FLASH_CR_PG,	0x0001	@ Programming
.equ	FLASH_CR_PER,	0x0002	@ Page Erase
.equ	FLASH_CR_MER,	0x0004	@ Mass Erase
.equ	FLASH_CR_OPTPG,	0x0010	@ Option Byte Programming
.equ	FLASH_CR_OPTER,	0x0020	@ Option Byte Erase
.equ	FLASH_CR_STRT,	0x0040	@ Start
.equ	FLASH_CR_LOCK,	0x0080	@ Lock
.equ	FLASH_CR_OPTWRE,	0x0200	@ Option Bytes Write Enable
.equ	FLASH_CR_ERRIE,	0x0400	@ Error Interrupt Enable
.equ	FLASH_CR_EOPIE,	0x1000	@ End of operation interrupt enable

@ Bit definition for FLASH_AR register
.equ	FLASH_AR_FAR,	0xFFFFFFFF	@ Flash Address

@ Bit definition for FLASH_OBR register
.equ	FLASH_OBR_OPTERR,	0x0001	@ Option Byte Error
.equ	FLASH_OBR_RDPRT,	0x0002	@ Read protection

.equ	FLASH_OBR_USER,	0x03FC	@ User Option Bytes
.equ	FLASH_OBR_WDG_SW,	0x0004	@ WDG_SW
.equ	FLASH_OBR_nRST_STOP,	0x0008	@ nRST_STOP
.equ	FLASH_OBR_nRST_STDBY,	0x0010	@ nRST_STDBY
.equ	FLASH_OBR_Notused,	0x03E0	@ Not used

@ Bit definition for FLASH_WRPR register
.equ	FLASH_WRPR_WRP,	0xFFFFFFFF	@ Write Protect

@----------------------------------------------------------------------------

@ Bit definition for FLASH_RDP register
.equ	FLASH_RDP_RDP,	0x000000FF	@ Read protection option byte
.equ	FLASH_RDP_nRDP,	0x0000FF00	@ Read protection complemented option byte

@ Bit definition for FLASH_USER register
.equ	FLASH_USER_USER,	0x00FF0000	@ User option byte
.equ	FLASH_USER_nUSER,	0xFF000000	@ User complemented option byte

@ Bit definition for FLASH_Data0 register
.equ	FLASH_Data0_Data0,	0x000000FF	@ User data storage option byte
.equ	FLASH_Data0_nData0,	0x0000FF00	@ User data storage complemented option byte

@ Bit definition for FLASH_Data1 register
.equ	FLASH_Data1_Data1,	0x00FF0000	@ User data storage option byte
.equ	FLASH_Data1_nData1,	0xFF000000	@ User data storage complemented option byte

@ Bit definition for FLASH_WRP0 register
.equ	FLASH_WRP0_WRP0,	0x000000FF	@ Flash memory write protection option bytes
.equ	FLASH_WRP0_nWRP0,	0x0000FF00	@ Flash memory write protection complemented option bytes

@ Bit definition for FLASH_WRP1 register
.equ	FLASH_WRP1_WRP1,	0x00FF0000	@ Flash memory write protection option bytes
.equ	FLASH_WRP1_nWRP1,	0xFF000000	@ Flash memory write protection complemented option bytes

@ Bit definition for FLASH_WRP2 register
.equ	FLASH_WRP2_WRP2,	0x000000FF	@ Flash memory write protection option bytes
.equ	FLASH_WRP2_nWRP2,	0x0000FF00	@ Flash memory write protection complemented option bytes

@ Bit definition for FLASH_WRP3 register
.equ	FLASH_WRP3_WRP3,	0x00FF0000	@ Flash memory write protection option bytes
.equ	FLASH_WRP3_nWRP3,	0xFF000000	@ Flash memory write protection complemented option bytes


.ifdef STM32F10X_CL

@ Ethernet MAC Registers bits definitions

@ Bit definition for Ethernet MAC Control Register register
.equ	ETH_MACCR_WD,	0x00800000	@ Watchdog disable
.equ	ETH_MACCR_JD,	0x00400000	@ Jabber disable
.equ	ETH_MACCR_IFG,	0x000E0000	@ Inter-frame gap
.equ	ETH_MACCR_IFG_96Bit,	0x00000000	@ Minimum IFG between frames during transmission is 96Bit
.equ	ETH_MACCR_IFG_88Bit,	0x00020000	@ Minimum IFG between frames during transmission is 88Bit
.equ	ETH_MACCR_IFG_80Bit,	0x00040000	@ Minimum IFG between frames during transmission is 80Bit
.equ	ETH_MACCR_IFG_72Bit,	0x00060000	@ Minimum IFG between frames during transmission is 72Bit
.equ	ETH_MACCR_IFG_64Bit,	0x00080000	@ Minimum IFG between frames during transmission is 64Bit
.equ	ETH_MACCR_IFG_56Bit,	0x000A0000	@ Minimum IFG between frames during transmission is 56Bit
.equ	ETH_MACCR_IFG_48Bit,	0x000C0000	@ Minimum IFG between frames during transmission is 48Bit
.equ	ETH_MACCR_IFG_40Bit,	0x000E0000	@ Minimum IFG between frames during transmission is 40Bit
.equ	ETH_MACCR_CSD,	0x00010000	@ Carrier sense disable (during transmission)
.equ	ETH_MACCR_FES,	0x00004000	@ Fast ethernet speed
.equ	ETH_MACCR_ROD,	0x00002000	@ Receive own disable
.equ	ETH_MACCR_LM,	0x00001000	@ loopback mode
.equ	ETH_MACCR_DM,	0x00000800	@ Duplex mode
.equ	ETH_MACCR_IPCO,	0x00000400	@ IP Checksum offload
.equ	ETH_MACCR_RD,	0x00000200	@ Retry disable
.equ	ETH_MACCR_APCS,	0x00000080	@ Automatic Pad/CRC stripping
.equ	ETH_MACCR_BL,	0x00000060	@ Back-off limit: random integer number (r) of slot time delays before rescheduling a transmission attempt during retries after a collision: 0 =< r <2^k
.equ	ETH_MACCR_BL_10,	0x00000000	@ k = min (n, 10)
.equ	ETH_MACCR_BL_8,	0x00000020	@ k = min (n, 8)
.equ	ETH_MACCR_BL_4,	0x00000040	@ k = min (n, 4)
.equ	ETH_MACCR_BL_1,	0x00000060	@ k = min (n, 1)
.equ	ETH_MACCR_DC,	0x00000010	@ Defferal check
.equ	ETH_MACCR_TE,	0x00000008	@ Transmitter enable
.equ	ETH_MACCR_RE,	0x00000004	@ Receiver enable

@ Bit definition for Ethernet MAC Frame Filter Register
.equ	ETH_MACFFR_RA,	0x80000000	@ Receive all
.equ	ETH_MACFFR_HPF,	0x00000400	@ Hash or perfect filter
.equ	ETH_MACFFR_SAF,	0x00000200	@ Source address filter enable
.equ	ETH_MACFFR_SAIF,	0x00000100	@ SA inverse filtering
.equ	ETH_MACFFR_PCF,	0x000000C0	@ Pass control frames: 3 cases
.equ	ETH_MACFFR_PCF_BlockAll,	0x00000040	@ MAC filters all control frames from reaching the application
.equ	ETH_MACFFR_PCF_ForwardAll,	0x00000080	@ MAC forwards all control frames to application even if they fail the Address Filter
.equ	ETH_MACFFR_PCF_ForwardPassedAddrFilter,	0x000000C0	@ MAC forwards control frames that pass the Address Filter.
.equ	ETH_MACFFR_BFD,	0x00000020	@ Broadcast frame disable
.equ	ETH_MACFFR_PAM,	0x00000010	@ Pass all mutlicast
.equ	ETH_MACFFR_DAIF,	0x00000008	@ DA Inverse filtering
.equ	ETH_MACFFR_HM,	0x00000004	@ Hash multicast
.equ	ETH_MACFFR_HU,	0x00000002	@ Hash unicast
.equ	ETH_MACFFR_PM,	0x00000001	@ Promiscuous mode

@ Bit definition for Ethernet MAC Hash Table High Register
.equ	ETH_MACHTHR_HTH,	0xFFFFFFFF	@ Hash table high

@ Bit definition for Ethernet MAC Hash Table Low Register
.equ	ETH_MACHTLR_HTL,	0xFFFFFFFF	@ Hash table low

@ Bit definition for Ethernet MAC MII Address Register
.equ	ETH_MACMIIAR_PA,	0x0000F800	@ Physical layer address
.equ	ETH_MACMIIAR_MR,	0x000007C0	@ MII register in the selected PHY
.equ	ETH_MACMIIAR_CR,	0x0000001C	@ CR clock range: 6 cases
.equ	ETH_MACMIIAR_CR_Div42,	0x00000000	@ HCLK:60-72 MHz@ MDC clock= HCLK/42
.equ	ETH_MACMIIAR_CR_Div16,	0x00000008	@ HCLK:20-35 MHz@ MDC clock= HCLK/16
.equ	ETH_MACMIIAR_CR_Div26,	0x0000000C	@ HCLK:35-60 MHz@ MDC clock= HCLK/26
.equ	ETH_MACMIIAR_MW,	0x00000002	@ MII write
.equ	ETH_MACMIIAR_MB,	0x00000001	@ MII busy

@ Bit definition for Ethernet MAC MII Data Register
.equ	ETH_MACMIIDR_MD,	0x0000FFFF	@ MII data: read/write data from/to PHY

@ Bit definition for Ethernet MAC Flow Control Register
.equ	ETH_MACFCR_PT,	0xFFFF0000	@ Pause time
.equ	ETH_MACFCR_ZQPD,	0x00000080	@ Zero-quanta pause disable
.equ	ETH_MACFCR_PLT,	0x00000030	@ Pause low threshold: 4 cases
.equ	ETH_MACFCR_PLT_Minus4,	0x00000000	@ Pause time minus 4 slot times
.equ	ETH_MACFCR_PLT_Minus28,	0x00000010	@ Pause time minus 28 slot times
.equ	ETH_MACFCR_PLT_Minus144,	0x00000020	@ Pause time minus 144 slot times
.equ	ETH_MACFCR_PLT_Minus256,	0x00000030	@ Pause time minus 256 slot times
.equ	ETH_MACFCR_UPFD,	0x00000008	@ Unicast pause frame detect
.equ	ETH_MACFCR_RFCE,	0x00000004	@ Receive flow control enable
.equ	ETH_MACFCR_TFCE,	0x00000002	@ Transmit flow control enable
.equ	ETH_MACFCR_FCBBPA,	0x00000001	@ Flow control busy/backpressure activate

@ Bit definition for Ethernet MAC VLAN Tag Register
.equ	ETH_MACVLANTR_VLANTC,	0x00010000	@ 12-bit VLAN tag comparison
.equ	ETH_MACVLANTR_VLANTI,	0x0000FFFF	@ VLAN tag identifier (for receive frames)

