Leonidov/STM32-Labs/Lab 1 - Hello World/CubeIDE_Assembler/Inc/stm32f10x.s
@ Bit definition for Ethernet DMA Receive Poll Demand Register
.equ	ETH_DMARPDR_RPD,	0xFFFFFFFF	@ Receive poll demand

@ Bit definition for Ethernet DMA Receive Descriptor List Address Register
.equ	ETH_DMARDLAR_SRL,	0xFFFFFFFF	@ Start of receive list

@ Bit definition for Ethernet DMA Transmit Descriptor List Address Register
.equ	ETH_DMATDLAR_STL,	0xFFFFFFFF	@ Start of transmit list

@ Bit definition for Ethernet DMA Status Register
.equ	ETH_DMASR_TSTS,	0x20000000	@ Time-stamp trigger status
.equ	ETH_DMASR_PMTS,	0x10000000	@ PMT status
.equ	ETH_DMASR_MMCS,	0x08000000	@ MMC status
.equ	ETH_DMASR_EBS,	0x03800000	@ Error bits status
@ combination with EBS[2:0] for GetFlagStatus function
.equ	ETH_DMASR_EBS_DescAccess,	0x02000000	@ Error bits 0-data buffer, 1-desc. access
.equ	ETH_DMASR_EBS_ReadTransf,	0x01000000	@ Error bits 0-write trnsf, 1-read transfr
.equ	ETH_DMASR_EBS_DataTransfTx,	0x00800000	@ Error bits 0-Rx DMA, 1-Tx DMA
.equ	ETH_DMASR_TPS,	0x00700000	@ Transmit process state
.equ	ETH_DMASR_TPS_Stopped,	0x00000000	@ Stopped - Reset or Stop Tx Command issued
.equ	ETH_DMASR_TPS_Fetching,	0x00100000	@ Running - fetching the Tx descriptor
.equ	ETH_DMASR_TPS_Waiting,	0x00200000	@ Running - waiting for status
.equ	ETH_DMASR_TPS_Reading,	0x00300000	@ Running - reading the data from host memory
.equ	ETH_DMASR_TPS_Suspended,	0x00600000	@ Suspended - Tx Descriptor unavailabe
.equ	ETH_DMASR_TPS_Closing,	0x00700000	@ Running - closing Rx descriptor
.equ	ETH_DMASR_RPS,	0x000E0000	@ Receive process state
.equ	ETH_DMASR_RPS_Stopped,	0x00000000	@ Stopped - Reset or Stop Rx Command issued
.equ	ETH_DMASR_RPS_Fetching,	0x00020000	@ Running - fetching the Rx descriptor
.equ	ETH_DMASR_RPS_Waiting,	0x00060000	@ Running - waiting for packet
.equ	ETH_DMASR_RPS_Suspended,	0x00080000	@ Suspended - Rx Descriptor unavailable
.equ	ETH_DMASR_RPS_Closing,	0x000A0000	@ Running - closing descriptor
.equ	ETH_DMASR_RPS_Queuing,	0x000E0000	@ Running - queuing the recieve frame into host memory
.equ	ETH_DMASR_NIS,	0x00010000	@ Normal interrupt summary
.equ	ETH_DMASR_AIS,	0x00008000	@ Abnormal interrupt summary
.equ	ETH_DMASR_ERS,	0x00004000	@ Early receive status
.equ	ETH_DMASR_FBES,	0x00002000	@ Fatal bus error status
.equ	ETH_DMASR_ETS,	0x00000400	@ Early transmit status
.equ	ETH_DMASR_RWTS,	0x00000200	@ Receive watchdog timeout status
.equ	ETH_DMASR_RPSS,	0x00000100	@ Receive process stopped status
.equ	ETH_DMASR_RBUS,	0x00000080	@ Receive buffer unavailable status
.equ	ETH_DMASR_RS,	0x00000040	@ Receive status
.equ	ETH_DMASR_TUS,	0x00000020	@ Transmit underflow status
.equ	ETH_DMASR_ROS,	0x00000010	@ Receive overflow status
.equ	ETH_DMASR_TJTS,	0x00000008	@ Transmit jabber timeout status
.equ	ETH_DMASR_TBUS,	0x00000004	@ Transmit buffer unavailable status
.equ	ETH_DMASR_TPSS,	0x00000002	@ Transmit process stopped status
.equ	ETH_DMASR_TS,	0x00000001	@ Transmit status

@ Bit definition for Ethernet DMA Operation Mode Register
.equ	ETH_DMAOMR_DTCEFD,	0x04000000	@ Disable Dropping of TCP/IP checksum error frames
.equ	ETH_DMAOMR_RSF,	0x02000000	@ Receive store and forward
.equ	ETH_DMAOMR_DFRF,	0x01000000	@ Disable flushing of received frames
.equ	ETH_DMAOMR_TSF,	0x00200000	@ Transmit store and forward
.equ	ETH_DMAOMR_FTF,	0x00100000	@ Flush transmit FIFO
.equ	ETH_DMAOMR_TTC,	0x0001C000	@ Transmit threshold control
.equ	ETH_DMAOMR_TTC_64Bytes,	0x00000000	@ threshold level of the MTL Transmit FIFO is 64 Bytes
.equ	ETH_DMAOMR_TTC_128Bytes,	0x00004000	@ threshold level of the MTL Transmit FIFO is 128 Bytes
.equ	ETH_DMAOMR_TTC_192Bytes,	0x00008000	@ threshold level of the MTL Transmit FIFO is 192 Bytes
.equ	ETH_DMAOMR_TTC_256Bytes,	0x0000C000	@ threshold level of the MTL Transmit FIFO is 256 Bytes
.equ	ETH_DMAOMR_TTC_40Bytes,	0x00010000	@ threshold level of the MTL Transmit FIFO is 40 Bytes
.equ	ETH_DMAOMR_TTC_32Bytes,	0x00014000	@ threshold level of the MTL Transmit FIFO is 32 Bytes
.equ	ETH_DMAOMR_TTC_24Bytes,	0x00018000	@ threshold level of the MTL Transmit FIFO is 24 Bytes
.equ	ETH_DMAOMR_TTC_16Bytes,	0x0001C000	@ threshold level of the MTL Transmit FIFO is 16 Bytes
.equ	ETH_DMAOMR_ST,	0x00002000	@ Start/stop transmission command
.equ	ETH_DMAOMR_FEF,	0x00000080	@ Forward error frames
.equ	ETH_DMAOMR_FUGF,	0x00000040	@ Forward undersized good frames
.equ	ETH_DMAOMR_RTC,	0x00000018	@ receive threshold control
.equ	ETH_DMAOMR_RTC_64Bytes,	0x00000000	@ threshold level of the MTL Receive FIFO is 64 Bytes
.equ	ETH_DMAOMR_RTC_32Bytes,	0x00000008	@ threshold level of the MTL Receive FIFO is 32 Bytes
.equ	ETH_DMAOMR_RTC_96Bytes,	0x00000010	@ threshold level of the MTL Receive FIFO is 96 Bytes
.equ	ETH_DMAOMR_RTC_128Bytes,	0x00000018	@ threshold level of the MTL Receive FIFO is 128 Bytes
.equ	ETH_DMAOMR_OSF,	0x00000004	@ operate on second frame
.equ	ETH_DMAOMR_SR,	0x00000002	@ Start/stop receive

@ Bit definition for Ethernet DMA Interrupt Enable Register
.equ	ETH_DMAIER_NISE,	0x00010000	@ Normal interrupt summary enable
.equ	ETH_DMAIER_AISE,	0x00008000	@ Abnormal interrupt summary enable
.equ	ETH_DMAIER_ERIE,	0x00004000	@ Early receive interrupt enable
.equ	ETH_DMAIER_FBEIE,	0x00002000	@ Fatal bus error interrupt enable
.equ	ETH_DMAIER_ETIE,	0x00000400	@ Early transmit interrupt enable
.equ	ETH_DMAIER_RWTIE,	0x00000200	@ Receive watchdog timeout interrupt enable
.equ	ETH_DMAIER_RPSIE,	0x00000100	@ Receive process stopped interrupt enable
.equ	ETH_DMAIER_RBUIE,	0x00000080	@ Receive buffer unavailable interrupt enable
.equ	ETH_DMAIER_RIE,	0x00000040	@ Receive interrupt enable
.equ	ETH_DMAIER_TUIE,	0x00000020	@ Transmit Underflow interrupt enable
.equ	ETH_DMAIER_ROIE,	0x00000010	@ Receive Overflow interrupt enable
.equ	ETH_DMAIER_TJTIE,	0x00000008	@ Transmit jabber timeout interrupt enable
.equ	ETH_DMAIER_TBUIE,	0x00000004	@ Transmit buffer unavailable interrupt enable
.equ	ETH_DMAIER_TPSIE,	0x00000002	@ Transmit process stopped interrupt enable
.equ	ETH_DMAIER_TIE,	0x00000001	@ Transmit interrupt enable

@ Bit definition for Ethernet DMA Missed Frame and Buffer Overflow Counter Register
.equ	ETH_DMAMFBOCR_OFOC,	0x10000000	@ Overflow bit for FIFO overflow counter
.equ	ETH_DMAMFBOCR_MFA,	0x0FFE0000	@ Number of frames missed by the application
.equ	ETH_DMAMFBOCR_OMFC,	0x00010000	@ Overflow bit for missed frame counter
.equ	ETH_DMAMFBOCR_MFC,	0x0000FFFF	@ Number of frames missed by the controller

@ Bit definition for Ethernet DMA Current Host Transmit Descriptor Register
.equ	ETH_DMACHTDR_HTDAP,	0xFFFFFFFF	@ Host transmit descriptor address pointer

@ Bit definition for Ethernet DMA Current Host Receive Descriptor Register
.equ	ETH_DMACHRDR_HRDAP,	0xFFFFFFFF	@ Host receive descriptor address pointer

@ Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register
.equ	ETH_DMACHTBAR_HTBAP,	0xFFFFFFFF	@ Host transmit buffer address pointer

@ Bit definition for Ethernet DMA Current Host Receive Buffer Address Register
.equ	ETH_DMACHRBAR_HRBAP,	0xFFFFFFFF	@ Host receive buffer address pointer
.endif @ STM32F10X_CL

